import { Category, Brand } from "@prisma/client";

const sampleData = {
  products: [
    // Samsung S25 Ultra - 12/512gb
    {
      slug: "samsung-s25-ultra-512",
      model: "Samsung S25 Ultra",
      fullName: "Samsung S25 Ultra - 12/512gb",
      category: Category.phone,
      brand: Brand.Samsung,
      images: [
        "/images/products/phones/s25-ultra/s25-ultra-512/preview.png",
        "/images/products/phones/s25-ultra/s25-ultra-512/1.jpeg",
        "/images/products/phones/s25-ultra/s25-ultra-512/2.jpeg",
        "/images/products/phones/s25-ultra/s25-ultra-512/3.jpeg",
        "/images/products/phones/s25-ultra/s25-ultra-512/4.jpeg",
        "/images/products/phones/s25-ultra/s25-ultra-512/5.jpeg",
      ],
      price: 6990,
      isNew: true,
      isBestseller: true,
      inStock: true,
      memory: 512,
      translations: {
        create: [
          // Український переклад
          {
            locale: "uk",
            descriptionInfo: {
              description: [
                [
                  "Основні",
                  [
                    ["Модель", "Samsung S25 Ultra"],
                    ["Операційна система", "Android 15"],
                    ["Рік випуску", "2025"],
                    ["Стілус", "S Pen"],
                  ],
                ],
                [
                  "Звя'зок",
                  [
                    ["Інтернет", "5G, 4G (LTE)"],
                    ["Кількість SIM", "2"],
                    ["Тип SIM", "Nano-SIM; eSIM"],
                  ],
                ],
                [
                  "Екран",
                  [
                    ["Діагональ", '6.9"'],
                    ["Матриця", "AMOLED 2x"],
                    ["Роздільна здатність", "3120x1440"],
                    ["Частота оновлення", "120Гц"],
                  ],
                ],
                [
                  "Процесор",
                  [
                    ["Модель", "Snapdragon 8 Gen 3"],
                    ["Ядра", "12"],
                    ["Максимальна частота", "3.0 ГГц"],
                  ],
                ],
                [
                  "Пам'ять",
                  [
                    ["Вбудована", "512ГБ"],
                    ["Оперативна", "12ГБ"],
                  ],
                ],
                [
                  "Камера",
                  [
                    ["Основна", "200МП"],
                    ["Фронтальна", "12МП"],
                  ],
                ],
                [
                  "Бездротові технології",
                  [
                    [
                      "Комунікації",
                      "Bluetooth; NFC; GPS; USB Type-C; BDS; Wi-F",
                    ],
                    ["Версія Bluetooth", "5.3"],
                  ],
                ],
                [
                  "Акумулятор",
                  [
                    ["Тип", "Li-Ion"],
                    ["Ємність", "5000мАг"],
                    [
                      "Технології зарядки",
                      "бездротова зарядка; швидка зарядка; реверсивна зарядка",
                    ],
                  ],
                ],
                [
                  "Корпус",
                  [
                    [
                      "Датчики",
                      "акселерометр; барометр; гіроскоп; датчик освітлення; датчик наближення; компас",
                    ],
                    [
                      "Безпека",
                      "розпізнавання особи; сканер відбитків пальців на екрані",
                    ],
                    ["Колір", "чорний, титан"],
                    ["Матеріал задньої кришки", "скло"],
                    ["Стандарт захисту", "IP68"],
                  ],
                ],
                [
                  "Розміри",
                  [
                    ["Габарити", "162.3 x 79.0 x 8.6мм"],
                    ["Вага", "232г"],
                  ],
                ],
                [
                  "Додатково",
                  [
                    ["Гарантія", "12 місяців"],
                    ["Оплата", "Оплата при отриманні товару"],
                  ],
                ],
              ],
            },
          },
          // Російський переклад
          {
            locale: "ru",
            descriptionInfo: {
              description: [
                [
                  "Основные",
                  [
                    ["Модель", "Samsung S25 Ultra"],
                    ["Операционная система", "Android 15"],
                    ["Год выпуска", "2025"],
                    ["Стилус", "S Pen"],
                  ],
                ],
                [
                  "Связь",
                  [
                    ["Интернет", "5G, 4G (LTE)"],
                    ["Количество SIM", "2"],
                    ["Тип SIM", "Nano-SIM; eSIM"],
                  ],
                ],
                [
                  "Экран",
                  [
                    ["Диагональ", '6.9"'],
                    ["Матрица", "AMOLED 2x"],
                    ["Разрешение", "3120x1440"],
                    ["Частота обновления", "120Гц"],
                  ],
                ],
                [
                  "Процессор",
                  [
                    ["Модель", "Snapdragon 8 Gen 3"],
                    ["Ядра", "12"],
                    ["Максимальная частота", "3.0 ГГц"],
                  ],
                ],
                [
                  "Память",
                  [
                    ["Встроенная", "512ГБ"],
                    ["Оперативная", "12ГБ"],
                  ],
                ],
                [
                  "Камера",
                  [
                    ["Основная", "200МП"],
                    ["Фронтальная", "12МП"],
                  ],
                ],
                [
                  "Беспроводные технологии",
                  [
                    [
                      "Коммуникации",
                      "Bluetooth; NFC; GPS; USB Type-C; BDS; Wi-F",
                    ],
                    ["Версия Bluetooth", "5.3"],
                  ],
                ],
                [
                  "Аккумулятор",
                  [
                    ["Тип", "Li-Ion"],
                    ["Емкость", "5000мАг"],
                    [
                      "Технологии зарядки",
                      "беспроводная зарядка; быстрая зарядка; реверсивная зарядка",
                    ],
                  ],
                ],
                [
                  "Корпус",
                  [
                    [
                      "Датчики",
                      "акселерометр; барометр; гироскоп; датчик освещенности; датчик приближения; компас",
                    ],
                    [
                      "Безопасность",
                      "распознавание лица; сканер отпечатков пальцев на экране",
                    ],
                    ["Цвет", "черный, титан"],
                    ["Материал задней крышки", "стекло"],
                    ["Стандарт защиты", "IP68"],
                  ],
                ],
                [
                  "Размеры",
                  [
                    ["Габариты", "162.3 x 79.0 x 8.6мм"],
                    ["Вес", "232г"],
                  ],
                ],
                [
                  "Дополнительно",
                  [
                    ["Гарантия", "12 месяцев"],
                    ["Оплата", "Оплата при получении товара"],
                  ],
                ],
              ],
            },
          },
        ],
      },
    },
    // Samsung S25 Ultra - 12/256gb
    {
      slug: "samsung-s25-ultra-256",
      model: "Samsung S25 Ultra",
      fullName: "Samsung S25 Ultra - 12/256gb",
      category: Category.phone,
      brand: Brand.Samsung,
      images: [
        "/images/products/phones/s25-ultra/s25-ultra-256/preview.png",
        "/images/products/phones/s25-ultra/s25-ultra-256/1.jpeg",
        "/images/products/phones/s25-ultra/s25-ultra-256/2.jpeg",
        "/images/products/phones/s25-ultra/s25-ultra-256/3.jpeg",
        "/images/products/phones/s25-ultra/s25-ultra-256/4.jpeg",
        "/images/products/phones/s25-ultra/s25-ultra-256/5.jpeg",
      ],
      price: 6490,
      isNew: true,
      isBestseller: true,
      inStock: true,
      memory: 256,
      translations: {
        create: [
          // Український переклад
          {
            locale: "uk",
            descriptionInfo: {
              description: [
                [
                  "Основні",
                  [
                    ["Модель", "Samsung S25 Ultra"],
                    ["Операційна система", "Android 15"],
                    ["Рік випуску", "2025"],
                    ["Стілус", "S Pen"],
                  ],
                ],
                [
                  "Звя'зок",
                  [
                    ["Інтернет", "5G, 4G (LTE)"],
                    ["Кількість SIM", "2"],
                    ["Тип SIM", "Nano-SIM; eSIM"],
                  ],
                ],
                [
                  "Екран",
                  [
                    ["Діагональ", '6.9"'],
                    ["Матриця", "AMOLED 2x"],
                    ["Роздільна здатність", "3120x1440"],
                    ["Частота оновлення", "120Гц"],
                  ],
                ],
                [
                  "Процесор",
                  [
                    ["Модель", "Snapdragon 8 Gen 3"],
                    ["Ядра", "12"],
                    ["Максимальна частота", "3.0 ГГц"],
                  ],
                ],
                [
                  "Пам'ять",
                  [
                    ["Вбудована", "256ГБ"],
                    ["Оперативна", "12ГБ"],
                  ],
                ],
                [
                  "Камера",
                  [
                    ["Основна", "200МП"],
                    ["Фронтальна", "12МП"],
                  ],
                ],
                [
                  "Бездротові технології",
                  [
                    [
                      "Комунікації",
                      "Bluetooth; NFC; GPS; USB Type-C; BDS; Wi-F",
                    ],
                    ["Версія Bluetooth", "5.3"],
                  ],
                ],
                [
                  "Акумулятор",
                  [
                    ["Тип", "Li-Ion"],
                    ["Ємність", "5000мАг"],
                    [
                      "Технології зарядки",
                      "бездротова зарядка; швидка зарядка; реверсивна зарядка",
                    ],
                  ],
                ],
                [
                  "Корпус",
                  [
                    [
                      "Датчики",
                      "акселерометр; барометр; гіроскоп; датчик освітлення; датчик наближення; компас",
                    ],
                    [
                      "Безпека",
                      "розпізнавання особи; сканер відбитків пальців на екрані",
                    ],
                    ["Колір", "чорний, титан"],
                    ["Матеріал задньої кришки", "скло"],
                    ["Стандарт захисту", "IP68"],
                  ],
                ],
                [
                  "Розміри",
                  [
                    ["Габарити", "162.3 x 79.0 x 8.6мм"],
                    ["Вага", "232г"],
                  ],
                ],
                [
                  "Додатково",
                  [
                    ["Гарантія", "12 місяців"],
                    ["Оплата", "Оплата при отриманні товару"],
                  ],
                ],
              ],
            },
          },
          // Російський переклад
          {
            locale: "ru",
            descriptionInfo: {
              description: [
                [
                  "Основные",
                  [
                    ["Модель", "Samsung S25 Ultra"],
                    ["Операционная система", "Android 15"],
                    ["Год выпуска", "2025"],
                    ["Стилус", "S Pen"],
                  ],
                ],
                [
                  "Связь",
                  [
                    ["Интернет", "5G, 4G (LTE)"],
                    ["Количество SIM", "2"],
                    ["Тип SIM", "Nano-SIM; eSIM"],
                  ],
                ],
                [
                  "Экран",
                  [
                    ["Диагональ", '6.9"'],
                    ["Матрица", "AMOLED 2x"],
                    ["Разрешение", "3120x1440"],
                    ["Частота обновления", "120Гц"],
                  ],
                ],
                [
                  "Процессор",
                  [
                    ["Модель", "Snapdragon 8 Gen 3"],
                    ["Ядра", "12"],
                    ["Максимальная частота", "3.0 ГГц"],
                  ],
                ],
                [
                  "Память",
                  [
                    ["Встроенная", "256ГБ"],
                    ["Оперативная", "12ГБ"],
                  ],
                ],
                [
                  "Камера",
                  [
                    ["Основная", "200МП"],
                    ["Фронтальная", "12МП"],
                  ],
                ],
                [
                  "Беспроводные технологии",
                  [
                    [
                      "Коммуникации",
                      "Bluetooth; NFC; GPS; USB Type-C; BDS; Wi-F",
                    ],
                    ["Версия Bluetooth", "5.3"],
                  ],
                ],
                [
                  "Аккумулятор",
                  [
                    ["Тип", "Li-Ion"],
                    ["Емкость", "5000мАг"],
                    [
                      "Технологии зарядки",
                      "беспроводная зарядка; быстрая зарядка; реверсивная зарядка",
                    ],
                  ],
                ],
                [
                  "Корпус",
                  [
                    [
                      "Датчики",
                      "акселерометр; барометр; гироскоп; датчик освещенности; датчик приближения; компас",
                    ],
                    [
                      "Безопасность",
                      "распознавание лица; сканер отпечатков пальцев на экране",
                    ],
                    ["Цвет", "черный, титан"],
                    ["Материал задней крышки", "стекло"],
                    ["Стандарт защиты", "IP68"],
                  ],
                ],
                [
                  "Размеры",
                  [
                    ["Габариты", "162.3 x 79.0 x 8.6мм"],
                    ["Вес", "232г"],
                  ],
                ],
                [
                  "Дополнительно",
                  [
                    ["Гарантия", "12 месяцев"],
                    ["Оплата", "Оплата при получении товара"],
                  ],
                ],
              ],
            },
          },
        ],
      },
    },
    // Samsung S25 Ultra - 16/1024gb
    {
      slug: "samsung-s25-ultra-1024",
      model: "Samsung S25 Ultra",
      fullName: "Samsung S25 Ultra - 16/1024b",
      category: Category.phone,
      brand: Brand.Samsung,
      images: [
        "/images/products/phones/s25-ultra/s25-ultra-1024/preview.png",
        "/images/products/phones/s25-ultra/s25-ultra-1024/1.jpeg",
        "/images/products/phones/s25-ultra/s25-ultra-1024/2.jpeg",
        "/images/products/phones/s25-ultra/s25-ultra-1024/3.jpeg",
        "/images/products/phones/s25-ultra/s25-ultra-1024/4.jpeg",
        "/images/products/phones/s25-ultra/s25-ultra-1024/5.jpeg",
      ],
      price: 7490,
      isNew: true,
      isBestseller: true,
      inStock: true,
      memory: 1024,
      translations: {
        create: [
          // Український переклад
          {
            locale: "uk",
            descriptionInfo: {
              description: [
                [
                  "Основні",
                  [
                    ["Модель", "Samsung S25 Ultra"],
                    ["Операційна система", "Android 15"],
                    ["Рік випуску", "2025"],
                    ["Стілус", "S Pen"],
                  ],
                ],
                [
                  "Звя'зок",
                  [
                    ["Інтернет", "5G, 4G (LTE)"],
                    ["Кількість SIM", "2"],
                    ["Тип SIM", "Nano-SIM; eSIM"],
                  ],
                ],
                [
                  "Екран",
                  [
                    ["Діагональ", '6.9"'],
                    ["Матриця", "AMOLED 2x"],
                    ["Роздільна здатність", "3120x1440"],
                    ["Частота оновлення", "120Гц"],
                  ],
                ],
                [
                  "Процесор",
                  [
                    ["Модель", "Snapdragon 8 Gen 3"],
                    ["Ядра", "12"],
                    ["Максимальна частота", "3.0 ГГц"],
                  ],
                ],
                [
                  "Пам'ять",
                  [
                    ["Вбудована", "1024ГБ"],
                    ["Оперативна", "16ГБ"],
                  ],
                ],
                [
                  "Камера",
                  [
                    ["Основна", "200МП"],
                    ["Фронтальна", "12МП"],
                  ],
                ],
                [
                  "Бездротові технології",
                  [
                    [
                      "Комунікації",
                      "Bluetooth; NFC; GPS; USB Type-C; BDS; Wi-F",
                    ],
                    ["Версія Bluetooth", "5.3"],
                  ],
                ],
                [
                  "Акумулятор",
                  [
                    ["Тип", "Li-Ion"],
                    ["Ємність", "5000мАг"],
                    [
                      "Технології зарядки",
                      "бездротова зарядка; швидка зарядка; реверсивна зарядка",
                    ],
                  ],
                ],
                [
                  "Корпус",
                  [
                    [
                      "Датчики",
                      "акселерометр; барометр; гіроскоп; датчик освітлення; датчик наближення; компас",
                    ],
                    [
                      "Безпека",
                      "розпізнавання особи; сканер відбитків пальців на екрані",
                    ],
                    ["Колір", "чорний, титан"],
                    ["Матеріал задньої кришки", "скло"],
                    ["Стандарт захисту", "IP68"],
                  ],
                ],
                [
                  "Розміри",
                  [
                    ["Габарити", "162.3 x 79.0 x 8.6мм"],
                    ["Вага", "232г"],
                  ],
                ],
                [
                  "Додатково",
                  [
                    ["Гарантія", "12 місяців"],
                    ["Оплата", "Оплата при отриманні товару"],
                  ],
                ],
              ],
            },
          },
          // Російський переклад
          {
            locale: "ru",
            descriptionInfo: {
              description: [
                [
                  "Основные",
                  [
                    ["Модель", "Samsung S25 Ultra"],
                    ["Операционная система", "Android 15"],
                    ["Год выпуска", "2025"],
                    ["Стилус", "S Pen"],
                  ],
                ],
                [
                  "Связь",
                  [
                    ["Интернет", "5G, 4G (LTE)"],
                    ["Количество SIM", "2"],
                    ["Тип SIM", "Nano-SIM; eSIM"],
                  ],
                ],
                [
                  "Экран",
                  [
                    ["Диагональ", '6.9"'],
                    ["Матрица", "AMOLED 2x"],
                    ["Разрешение", "3120x1440"],
                    ["Частота обновления", "120Гц"],
                  ],
                ],
                [
                  "Процессор",
                  [
                    ["Модель", "Snapdragon 8 Gen 3"],
                    ["Ядра", "12"],
                    ["Максимальная частота", "3.0 ГГц"],
                  ],
                ],
                [
                  "Память",
                  [
                    ["Встроенная", "1024ГБ"],
                    ["Оперативная", "16ГБ"],
                  ],
                ],
                [
                  "Камера",
                  [
                    ["Основная", "200МП"],
                    ["Фронтальная", "12МП"],
                  ],
                ],
                [
                  "Беспроводные технологии",
                  [
                    [
                      "Коммуникации",
                      "Bluetooth; NFC; GPS; USB Type-C; BDS; Wi-F",
                    ],
                    ["Версия Bluetooth", "5.3"],
                  ],
                ],
                [
                  "Аккумулятор",
                  [
                    ["Тип", "Li-Ion"],
                    ["Емкость", "5000мАг"],
                    [
                      "Технологии зарядки",
                      "беспроводная зарядка; быстрая зарядка; реверсивная зарядка",
                    ],
                  ],
                ],
                [
                  "Корпус",
                  [
                    [
                      "Датчики",
                      "акселерометр; барометр; гироскоп; датчик освещенности; датчик приближения; компас",
                    ],
                    [
                      "Безопасность",
                      "распознавание лица; сканер отпечатков пальцев на экране",
                    ],
                    ["Цвет", "черный, титан"],
                    ["Материал задней крышки", "стекло"],
                    ["Стандарт защиты", "IP68"],
                  ],
                ],
                [
                  "Размеры",
                  [
                    ["Габариты", "162.3 x 79.0 x 8.6мм"],
                    ["Вес", "232г"],
                  ],
                ],
                [
                  "Дополнительно",
                  [
                    ["Гарантия", "12 месяцев"],
                    ["Оплата", "Оплата при получении товара"],
                  ],
                ],
              ],
            },
          },
        ],
      },
    },
    // Samsung S24 Ultra - 12/256gb
    {
      slug: "samsung-s24-ultra-256",
      model: "Samsung S24 Ultra",
      fullName: "Samsung S24 Ultra - 12/256gb",
      category: Category.phone,
      brand: Brand.Samsung,
      images: [
        "/images/products/phones/s24-ultra/s24-ultra-256/preview.png",
        "/images/products/phones/s24-ultra/s24-ultra-256/1.jpg",
        "/images/products/phones/s24-ultra/s24-ultra-256/2.jpg",
        "/images/products/phones/s24-ultra/s24-ultra-256/3.jpg",
        "/images/products/phones/s24-ultra/s24-ultra-256/4.jpg",
      ],
      price: 5990,
      isNew: true,
      isBestseller: true,
      inStock: true,
      memory: 256,
      translations: {
        create: [
          // Український переклад
          {
            locale: "uk",
            descriptionInfo: {
              description: [
                [
                  "Основні",
                  [
                    ["Модель", "Samsung S24 Ultra"],
                    ["Операційна система", "Android 14"],
                    ["Рік випуску", "2024"],
                    ["Стілус", "S Pen"],
                  ],
                ],
                [
                  "Звя'зок",
                  [
                    ["Інтернет", "5G, 4G (LTE)"],
                    ["Кількість SIM", "2"],
                    ["Тип SIM", "Nano-SIM; eSIM"],
                  ],
                ],
                [
                  "Екран",
                  [
                    ["Діагональ", '6.8"'],
                    ["Матриця", "AMOLED 2x"],
                    ["Роздільна здатність", "3120x1440"],
                    ["Частота оновлення", "120Гц"],
                  ],
                ],
                [
                  "Процесор",
                  [
                    ["Модель", "Snapdragon 8 Gen 3"],
                    ["Ядра", "10"],
                    ["Максимальна частота", "3.0 ГГц"],
                  ],
                ],
                [
                  "Пам'ять",
                  [
                    ["Вбудована", "256ГБ"],
                    ["Оперативна", "12ГБ"],
                  ],
                ],
                [
                  "Камера",
                  [
                    ["Основна", "200МП"],
                    ["Фронтальна", "12МП"],
                  ],
                ],
                [
                  "Бездротові технології",
                  [
                    [
                      "Комунікації",
                      "Bluetooth; NFC; GPS; USB Type-C; BDS; Wi-F",
                    ],
                    ["Версія Bluetooth", "5.3"],
                  ],
                ],
                [
                  "Акумулятор",
                  [
                    ["Тип", "Li-Ion"],
                    ["Ємність", "5000мАг"],
                    [
                      "Технології зарядки",
                      "бездротова зарядка; швидка зарядка; реверсивна зарядка",
                    ],
                  ],
                ],
                [
                  "Корпус",
                  [
                    [
                      "Датчики",
                      "акселерометр; барометр; гіроскоп; датчик освітлення; датчик наближення; компас",
                    ],
                    [
                      "Безпека",
                      "розпізнавання особи; сканер відбитків пальців на екрані",
                    ],
                    ["Колір", "чорний"],
                    ["Матеріал задньої кришки", "скло"],
                    ["Стандарт захисту", "IP68"],
                  ],
                ],
                [
                  "Розміри",
                  [
                    ["Габарити", "162.3 x 79.0 x 8.6мм"],
                    ["Вага", "232г"],
                  ],
                ],
                [
                  "Додатково",
                  [
                    ["Гарантія", "12 місяців"],
                    ["Оплата", "Оплата при отриманні товару"],
                  ],
                ],
              ],
            },
          },
          // Російський переклад
          {
            locale: "ru",
            descriptionInfo: {
              description: [
                [
                  "Основные",
                  [
                    ["Модель", "Samsung S24 Ultra"],
                    ["Операционная система", "Android 14"],
                    ["Год выпуска", "2024"],
                    ["Стилус", "S Pen"],
                  ],
                ],
                [
                  "Связь",
                  [
                    ["Интернет", "5G, 4G (LTE)"],
                    ["Количество SIM", "2"],
                    ["Тип SIM", "Nano-SIM; eSIM"],
                  ],
                ],
                [
                  "Экран",
                  [
                    ["Диагональ", '6.8"'],
                    ["Матрица", "AMOLED 2x"],
                    ["Разрешение", "3120x1440"],
                    ["Частота обновления", "120Гц"],
                  ],
                ],
                [
                  "Процессор",
                  [
                    ["Модель", "Snapdragon 8 Gen 3"],
                    ["Ядра", "10"],
                    ["Максимальная частота", "3.0 ГГц"],
                  ],
                ],
                [
                  "Память",
                  [
                    ["Встроенная", "256ГБ"],
                    ["Оперативная", "12ГБ"],
                  ],
                ],
                [
                  "Камера",
                  [
                    ["Основная", "200МП"],
                    ["Фронтальная", "12МП"],
                  ],
                ],
                [
                  "Беспроводные технологии",
                  [
                    [
                      "Коммуникации",
                      "Bluetooth; NFC; GPS; USB Type-C; BDS; Wi-F",
                    ],
                    ["Версия Bluetooth", "5.3"],
                  ],
                ],
                [
                  "Аккумулятор",
                  [
                    ["Тип", "Li-Ion"],
                    ["Емкость", "5000мАг"],
                    [
                      "Технологии зарядки",
                      "беспроводная зарядка; быстрая зарядка; реверсивная зарядка",
                    ],
                  ],
                ],
                [
                  "Корпус",
                  [
                    [
                      "Датчики",
                      "акселерометр; барометр; гироскоп; датчик освещенности; датчик приближения; компас",
                    ],
                    [
                      "Безопасность",
                      "распознавание лица; сканер отпечатков пальцев на экране",
                    ],
                    ["Цвет", "черный"],
                    ["Материал задней крышки", "стекло"],
                    ["Стандарт защиты", "IP68"],
                  ],
                ],
                [
                  "Размеры",
                  [
                    ["Габариты", "162.3 x 79.0 x 8.6мм"],
                    ["Вес", "232г"],
                  ],
                ],
                [
                  "Дополнительно",
                  [
                    ["Гарантия", "12 месяцев"],
                    ["Оплата", "Оплата при получении товара"],
                  ],
                ],
              ],
            },
          },
        ],
      },
    },
    // Samsung S24 Ultra - 12/512gb
    {
      slug: "samsung-s24-ultra-512",
      model: "Samsung S24 Ultra",
      fullName: "Samsung S24 Ultra - 12/512gb",
      category: Category.phone,
      brand: Brand.Samsung,
      images: [
        "/images/products/phones/s24-ultra/s24-ultra-512/preview.png",
        "/images/products/phones/s24-ultra/s24-ultra-512/1.jpg",
        "/images/products/phones/s24-ultra/s24-ultra-512/2.jpg",
        "/images/products/phones/s24-ultra/s24-ultra-512/3.jpg",
        "/images/products/phones/s24-ultra/s24-ultra-512/4.jpg",
      ],
      price: 6490,
      isNew: true,
      isBestseller: true,
      inStock: true,
      memory: 512,
      translations: {
        create: [
          // Український переклад
          {
            locale: "uk",
            descriptionInfo: {
              description: [
                [
                  "Основні",
                  [
                    ["Модель", "Samsung S24 Ultra"],
                    ["Операційна система", "Android 14"],
                    ["Рік випуску", "2024"],
                    ["Стілус", "S Pen"],
                  ],
                ],
                [
                  "Звя'зок",
                  [
                    ["Інтернет", "5G, 4G (LTE)"],
                    ["Кількість SIM", "2"],
                    ["Тип SIM", "Nano-SIM; eSIM"],
                  ],
                ],
                [
                  "Екран",
                  [
                    ["Діагональ", '6.8"'],
                    ["Матриця", "AMOLED 2x"],
                    ["Роздільна здатність", "3120x1440"],
                    ["Частота оновлення", "120Гц"],
                  ],
                ],
                [
                  "Процесор",
                  [
                    ["Модель", "Snapdragon 8 Gen 3"],
                    ["Ядра", "10"],
                    ["Максимальна частота", "3.0 ГГц"],
                  ],
                ],
                [
                  "Пам'ять",
                  [
                    ["Вбудована", "512ГБ"],
                    ["Оперативна", "12ГБ"],
                  ],
                ],
                [
                  "Камера",
                  [
                    ["Основна", "200МП"],
                    ["Фронтальна", "12МП"],
                  ],
                ],
                [
                  "Бездротові технології",
                  [
                    [
                      "Комунікації",
                      "Bluetooth; NFC; GPS; USB Type-C; BDS; Wi-F",
                    ],
                    ["Версія Bluetooth", "5.3"],
                  ],
                ],
                [
                  "Акумулятор",
                  [
                    ["Тип", "Li-Ion"],
                    ["Ємність", "5000мАг"],
                    [
                      "Технології зарядки",
                      "бездротова зарядка; швидка зарядка; реверсивна зарядка",
                    ],
                  ],
                ],
                [
                  "Корпус",
                  [
                    [
                      "Датчики",
                      "акселерометр; барометр; гіроскоп; датчик освітлення; датчик наближення; компас",
                    ],
                    [
                      "Безпека",
                      "розпізнавання особи; сканер відбитків пальців на екрані",
                    ],
                    ["Колір", "чорний"],
                    ["Матеріал задньої кришки", "скло"],
                    ["Стандарт захисту", "IP68"],
                  ],
                ],
                [
                  "Розміри",
                  [
                    ["Габарити", "162.3 x 79.0 x 8.6мм"],
                    ["Вага", "232г"],
                  ],
                ],
                [
                  "Додатково",
                  [
                    ["Гарантія", "12 місяців"],
                    ["Оплата", "Оплата при отриманні товару"],
                  ],
                ],
              ],
            },
          },
          // Російський переклад
          {
            locale: "ru",
            descriptionInfo: {
              description: [
                [
                  "Основные",
                  [
                    ["Модель", "Samsung S24 Ultra"],
                    ["Операционная система", "Android 14"],
                    ["Год выпуска", "2024"],
                    ["Стилус", "S Pen"],
                  ],
                ],
                [
                  "Связь",
                  [
                    ["Интернет", "5G, 4G (LTE)"],
                    ["Количество SIM", "2"],
                    ["Тип SIM", "Nano-SIM; eSIM"],
                  ],
                ],
                [
                  "Экран",
                  [
                    ["Диагональ", '6.8"'],
                    ["Матрица", "AMOLED 2x"],
                    ["Разрешение", "3120x1440"],
                    ["Частота обновления", "120Гц"],
                  ],
                ],
                [
                  "Процессор",
                  [
                    ["Модель", "Snapdragon 8 Gen 3"],
                    ["Ядра", "10"],
                    ["Максимальная частота", "3.0 ГГц"],
                  ],
                ],
                [
                  "Память",
                  [
                    ["Встроенная", "512ГБ"],
                    ["Оперативная", "12ГБ"],
                  ],
                ],
                [
                  "Камера",
                  [
                    ["Основная", "200МП"],
                    ["Фронтальная", "12МП"],
                  ],
                ],
                [
                  "Беспроводные технологии",
                  [
                    [
                      "Коммуникации",
                      "Bluetooth; NFC; GPS; USB Type-C; BDS; Wi-F",
                    ],
                    ["Версия Bluetooth", "5.3"],
                  ],
                ],
                [
                  "Аккумулятор",
                  [
                    ["Тип", "Li-Ion"],
                    ["Емкость", "5000мАг"],
                    [
                      "Технологии зарядки",
                      "беспроводная зарядка; быстрая зарядка; реверсивная зарядка",
                    ],
                  ],
                ],
                [
                  "Корпус",
                  [
                    [
                      "Датчики",
                      "акселерометр; барометр; гироскоп; датчик освещенности; датчик приближения; компас",
                    ],
                    [
                      "Безопасность",
                      "распознавание лица; сканер отпечатков пальцев на экране",
                    ],
                    ["Цвет", "черный"],
                    ["Материал задней крышки", "стекло"],
                    ["Стандарт защиты", "IP68"],
                  ],
                ],
                [
                  "Размеры",
                  [
                    ["Габариты", "162.3 x 79.0 x 8.6мм"],
                    ["Вес", "232г"],
                  ],
                ],
                [
                  "Дополнительно",
                  [
                    ["Гарантия", "12 месяцев"],
                    ["Оплата", "Оплата при получении товара"],
                  ],
                ],
              ],
            },
          },
        ],
      },
    },
    // Samsung S24 Ultra - 12/1024gb
    {
      slug: "samsung-s24-ultra-1024",
      model: "Samsung S24 Ultra",
      fullName: "Samsung S24 Ultra - 12/1024gb",
      category: Category.phone,
      brand: Brand.Samsung,
      images: [
        "/images/products/phones/s24-ultra/s24-ultra-1024/preview.png",
        "/images/products/phones/s24-ultra/s24-ultra-1024/1.jpg",
        "/images/products/phones/s24-ultra/s24-ultra-1024/2.jpg",
        "/images/products/phones/s24-ultra/s24-ultra-1024/3.jpg",
        "/images/products/phones/s24-ultra/s24-ultra-1024/4.jpg",
      ],
      price: 6990,
      isNew: true,
      isBestseller: false,
      inStock: true,
      memory: 1024,
      translations: {
        create: [
          // Український переклад
          {
            locale: "uk",
            descriptionInfo: {
              description: [
                [
                  "Основні",
                  [
                    ["Модель", "Samsung S24 Ultra"],
                    ["Операційна система", "Android 14"],
                    ["Рік випуску", "2024"],
                    ["Стілус", "S Pen"],
                  ],
                ],
                [
                  "Звя'зок",
                  [
                    ["Інтернет", "5G, 4G (LTE)"],
                    ["Кількість SIM", "2"],
                    ["Тип SIM", "Nano-SIM; eSIM"],
                  ],
                ],
                [
                  "Екран",
                  [
                    ["Діагональ", '6.8"'],
                    ["Матриця", "AMOLED 2x"],
                    ["Роздільна здатність", "3120x1440"],
                    ["Частота оновлення", "120Гц"],
                  ],
                ],
                [
                  "Процесор",
                  [
                    ["Модель", "Snapdragon 8 Gen 3"],
                    ["Ядра", "10"],
                    ["Максимальна частота", "3.0 ГГц"],
                  ],
                ],
                [
                  "Пам'ять",
                  [
                    ["Вбудована", "1024ГБ"],
                    ["Оперативна", "12ГБ"],
                  ],
                ],
                [
                  "Камера",
                  [
                    ["Основна", "200МП"],
                    ["Фронтальна", "12МП"],
                  ],
                ],
                [
                  "Бездротові технології",
                  [
                    [
                      "Комунікації",
                      "Bluetooth; NFC; GPS; USB Type-C; BDS; Wi-F",
                    ],
                    ["Версія Bluetooth", "5.3"],
                  ],
                ],
                [
                  "Акумулятор",
                  [
                    ["Тип", "Li-Ion"],
                    ["Ємність", "5000мАг"],
                    [
                      "Технології зарядки",
                      "бездротова зарядка; швидка зарядка; реверсивна зарядка",
                    ],
                  ],
                ],
                [
                  "Корпус",
                  [
                    [
                      "Датчики",
                      "акселерометр; барометр; гіроскоп; датчик освітлення; датчик наближення; компас",
                    ],
                    [
                      "Безпека",
                      "розпізнавання особи; сканер відбитків пальців на екрані",
                    ],
                    ["Колір", "чорний"],
                    ["Матеріал задньої кришки", "скло"],
                    ["Стандарт захисту", "IP68"],
                  ],
                ],
                [
                  "Розміри",
                  [
                    ["Габарити", "162.3 x 79.0 x 8.6мм"],
                    ["Вага", "232г"],
                  ],
                ],
                [
                  "Додатково",
                  [
                    ["Гарантія", "12 місяців"],
                    ["Оплата", "Оплата при отриманні товару"],
                  ],
                ],
              ],
            },
          },
          // Російський переклад
          {
            locale: "ru",
            descriptionInfo: {
              description: [
                [
                  "Основные",
                  [
                    ["Модель", "Samsung S24 Ultra"],
                    ["Операционная система", "Android 14"],
                    ["Год выпуска", "2024"],
                    ["Стилус", "S Pen"],
                  ],
                ],
                [
                  "Связь",
                  [
                    ["Интернет", "5G, 4G (LTE)"],
                    ["Количество SIM", "2"],
                    ["Тип SIM", "Nano-SIM; eSIM"],
                  ],
                ],
                [
                  "Экран",
                  [
                    ["Диагональ", '6.8"'],
                    ["Матрица", "AMOLED 2x"],
                    ["Разрешение", "3120x1440"],
                    ["Частота обновления", "120Гц"],
                  ],
                ],
                [
                  "Процессор",
                  [
                    ["Модель", "Snapdragon 8 Gen 3"],
                    ["Ядра", "10"],
                    ["Максимальная частота", "3.0 ГГц"],
                  ],
                ],
                [
                  "Память",
                  [
                    ["Встроенная", "1024ГБ"],
                    ["Оперативная", "12ГБ"],
                  ],
                ],
                [
                  "Камера",
                  [
                    ["Основная", "200МП"],
                    ["Фронтальная", "12МП"],
                  ],
                ],
                [
                  "Беспроводные технологии",
                  [
                    [
                      "Коммуникации",
                      "Bluetooth; NFC; GPS; USB Type-C; BDS; Wi-F",
                    ],
                    ["Версия Bluetooth", "5.3"],
                  ],
                ],
                [
                  "Аккумулятор",
                  [
                    ["Тип", "Li-Ion"],
                    ["Емкость", "5000мАг"],
                    [
                      "Технологии зарядки",
                      "беспроводная зарядка; быстрая зарядка; реверсивная зарядка",
                    ],
                  ],
                ],
                [
                  "Корпус",
                  [
                    [
                      "Датчики",
                      "акселерометр; барометр; гироскоп; датчик освещенности; датчик приближения; компас",
                    ],
                    [
                      "Безопасность",
                      "распознавание лица; сканер отпечатков пальцев на экране",
                    ],
                    ["Цвет", "черный"],
                    ["Материал задней крышки", "стекло"],
                    ["Стандарт защиты", "IP68"],
                  ],
                ],
                [
                  "Размеры",
                  [
                    ["Габариты", "162.3 x 79.0 x 8.6мм"],
                    ["Вес", "232г"],
                  ],
                ],
                [
                  "Дополнительно",
                  [
                    ["Гарантия", "12 месяцев"],
                    ["Оплата", "Оплата при получении товара"],
                  ],
                ],
              ],
            },
          },
        ],
      },
    },
    // Galaxy Tab 18 Pro
    {
      slug: "samsung-tab-18-pro",
      model: "Galaxy Tab 18 Pro",
      fullName: "Galaxy Tab 18 Pro",
      category: Category.tablet,
      brand: Brand.Samsung,
      images: [
        "/images/products/tablets/galaxy-tab-18-pro/preview.png",
        "/images/products/tablets/galaxy-tab-18-pro/1.jpg",
        "/images/products/tablets/galaxy-tab-18-pro/2.jpg",
      ],
      price: 5499,
      isNew: true,
      isBestseller: true,
      inStock: true,
      translations: {
        create: [
          // Український переклад
          {
            locale: "uk",
            descriptionInfo: {
              description: [
                [
                  "Основні",
                  [
                    ["Модель", "Galaxy Tab 18 Pro"],
                    ["Операційна система", "Android 14"],
                    ["Рік випуску", "2025"],
                  ],
                ],
                [
                  "Звя'зок",
                  [
                    ["Інтернет", "5G, 4G (LTE), 3G"],
                    ["Кількість SIM", "1"],
                    ["Тип SIM", "Nano-SIM"],
                  ],
                ],
                [
                  "Екран",
                  [
                    ["Діагональ", '10"'],
                    ["Матриця", "AMOLED 2x"],
                    ["Роздільна здатність", "1920x1080"],
                    ["Частота оновлення", "120Гц"],
                  ],
                ],
                [
                  "Процесор",
                  [
                    ["Модель", "Exynos 1380"],
                    ["Ядра", "10"],
                    ["Максимальна частота", "3.7 ГГц"],
                  ],
                ],
                [
                  "Пам'ять",
                  [
                    ["Вбудована", "128ГБ"],
                    ["Оперативна", "8ГБ"],
                  ],
                ],
                [
                  "Камера",
                  [
                    ["Основна", "64МП"],
                    ["Фронтальна", "18МП"],
                  ],
                ],
                [
                  "Бездротові технології",
                  [
                    [
                      "Комунікації",
                      "Bluetooth; NFC; GPS; USB Type-C; BDS; Wi-F",
                    ],
                    ["Версія Bluetooth", "5.3"],
                  ],
                ],
                [
                  "Акумулятор",
                  [
                    ["Тип", "Li-Ion"],
                    ["Ємність", "8700мАг"],
                    [
                      "Технології зарядки",
                      "швидка зарядка; реверсивна зарядка",
                    ],
                  ],
                ],
                [
                  "Корпус",
                  [
                    [
                      "Датчики",
                      "акселерометр; барометр; гіроскоп; датчик освітлення; датчик наближення; компас",
                    ],
                    ["Безпека", " сканер відбитків пальців на екрані"],
                    ["Колір", "чорний"],
                    ["Матеріал задньої кришки", "метал"],
                    ["Стандарт захисту", "IP67"],
                  ],
                ],
                [
                  "Розміри",
                  [
                    ["Габарити", "165.8 x 254.3 x 6.5мм"],
                    ["Вага", "465г"],
                  ],
                ],
                [
                  "Додатково",
                  [
                    ["Гарантія", "12 місяців"],
                    ["Оплата", "Оплата при отриманні товару"],
                  ],
                ],
              ],
            },
          },
          // Російський переклад
          {
            locale: "ru",
            descriptionInfo: {
              description: [
                [
                  "Основные",
                  [
                    ["Модель", "Galaxy Tab 18 Pro"],
                    ["Операционная система", "Android 14"],
                    ["Год выпуска", "2025"],
                  ],
                ],
                [
                  "Связь",
                  [
                    ["Интернет", "5G, 4G (LTE), 3G"],
                    ["Количество SIM", "1"],
                    ["Тип SIM", "Nano-SIM"],
                  ],
                ],
                [
                  "Экран",
                  [
                    ["Диагональ", '10"'],
                    ["Матрица", "AMOLED 2x"],
                    ["Разрешение", "1920x1080"],
                    ["Частота обновления", "120Гц"],
                  ],
                ],
                [
                  "Процессор",
                  [
                    ["Модель", "Exynos 1380"],
                    ["Ядра", "10"],
                    ["Максимальная частота", "3.7 ГГц"],
                  ],
                ],
                [
                  "Память",
                  [
                    ["Встроенная", "128ГБ"],
                    ["Оперативная", "8ГБ"],
                  ],
                ],
                [
                  "Камера",
                  [
                    ["Основная", "64МП"],
                    ["Фронтальная", "18МП"],
                  ],
                ],
                [
                  "Беспроводные технологии",
                  [
                    [
                      "Коммуникации",
                      "Bluetooth; NFC; GPS; USB Type-C; BDS; Wi-F",
                    ],
                    ["Версия Bluetooth", "5.3"],
                  ],
                ],
                [
                  "Аккумулятор",
                  [
                    ["Тип", "Li-Ion"],
                    ["Емкость", "8700мАг"],
                    [
                      "Технологии зарядки",
                      "быстрая зарядка; реверсивная зарядка",
                    ],
                  ],
                ],
                [
                  "Корпус",
                  [
                    [
                      "Датчики",
                      "акселерометр; барометр; гироскоп; датчик освещенности; датчик приближения; компас",
                    ],
                    ["Безопасность", "сканер отпечатков пальцев на экране"],
                    ["Цвет", "черный"],
                    ["Материал задней крышки", "метал"],
                    ["Стандарт защиты", "IP67"],
                  ],
                ],
                [
                  "Размеры",
                  [
                    ["Габариты", "165.8 x 254.3 x 6.5мм"],
                    ["Вес", "465г"],
                  ],
                ],
                [
                  "Дополнительно",
                  [
                    ["Гарантия", "12 месяцев"],
                    ["Оплата", "Оплата при получении товара"],
                  ],
                ],
              ],
            },
          },
        ],
      },
    },
    // Galaxy Tab 12 Pro
    {
      slug: "samsung-tab-12-pro",
      model: "Galaxy Tab 12 Pro",
      fullName: "Galaxy Tab 12 Pro",
      category: Category.tablet,
      brand: Brand.Samsung,
      images: [
        "/images/products/tablets/galaxy-tab-12-pro/preview.png",
        "/images/products/tablets/galaxy-tab-12-pro/1.jpg",
        "/images/products/tablets/galaxy-tab-12-pro/2.jpg",
        "/images/products/tablets/galaxy-tab-12-pro/3.jpg",
      ],
      price: 4990,
      isNew: true,
      isBestseller: true,
      inStock: true,
      translations: {
        create: [
          // Український переклад
          {
            locale: "uk",
            descriptionInfo: {
              description: [
                [
                  "Основні",
                  [
                    ["Модель", "Galaxy Tab 12 Pro"],
                    ["Операційна система", "Android 14"],
                    ["Рік випуску", "2024"],
                  ],
                ],
                [
                  "Звя'зок",
                  [
                    ["Інтернет", "4G (LTE), 3G"],
                    ["Кількість SIM", "1"],
                    ["Тип SIM", "Nano-SIM"],
                  ],
                ],
                [
                  "Екран",
                  [
                    ["Діагональ", '10"'],
                    ["Матриця", "AMOLED 2"],
                    ["Роздільна здатність", "1920x1080"],
                    ["Частота оновлення", "120Гц"],
                  ],
                ],
                [
                  "Процесор",
                  [
                    ["Модель", "Exynos 1280"],
                    ["Ядра", "10"],
                    ["Максимальна частота", "3.3 ГГц"],
                  ],
                ],
                [
                  "Пам'ять",
                  [
                    ["Вбудована", "128ГБ"],
                    ["Оперативна", "8ГБ"],
                  ],
                ],
                [
                  "Камера",
                  [
                    ["Основна", "32МП"],
                    ["Фронтальна", "14МП"],
                  ],
                ],
                [
                  "Бездротові технології",
                  [
                    [
                      "Комунікації",
                      "Bluetooth; NFC; GPS; USB Type-C; BDS; Wi-F",
                    ],
                    ["Версія Bluetooth", "5.3"],
                  ],
                ],
                [
                  "Акумулятор",
                  [
                    ["Тип", "Li-Ion"],
                    ["Ємність", "8000мАг"],
                    [
                      "Технології зарядки",
                      "швидка зарядка; реверсивна зарядка",
                    ],
                  ],
                ],
                [
                  "Корпус",
                  [
                    [
                      "Датчики",
                      "акселерометр; барометр; гіроскоп; датчик освітлення; датчик наближення; компас",
                    ],
                    ["Безпека", " сканер відбитків пальців на екрані"],
                    ["Колір", "чорний"],
                    ["Матеріал задньої кришки", "метал"],
                    ["Стандарт захисту", "IP67"],
                  ],
                ],
                [
                  "Розміри",
                  [
                    ["Габарити", "165.8 x 254.3 x 6.5мм"],
                    ["Вага", "465г"],
                  ],
                ],
                [
                  "Додатково",
                  [
                    ["Гарантія", "12 місяців"],
                    ["Оплата", "Оплата при отриманні товару"],
                  ],
                ],
              ],
            },
          },
          // Російський переклад
          {
            locale: "ru",
            descriptionInfo: {
              description: [
                [
                  "Основные",
                  [
                    ["Модель", "Galaxy Tab 12 Pro"],
                    ["Операционная система", "Android 14"],
                    ["Год выпуска", "2024"],
                  ],
                ],
                [
                  "Связь",
                  [
                    ["Интернет", "4G (LTE), 3G"],
                    ["Количество SIM", "1"],
                    ["Тип SIM", "Nano-SIM"],
                  ],
                ],
                [
                  "Экран",
                  [
                    ["Диагональ", '10"'],
                    ["Матрица", "AMOLED 2"],
                    ["Разрешение", "1920x1080"],
                    ["Частота обновления", "120Гц"],
                  ],
                ],
                [
                  "Процессор",
                  [
                    ["Модель", "Exynos 1280"],
                    ["Ядра", "10"],
                    ["Максимальная частота", "3.3 ГГц"],
                  ],
                ],
                [
                  "Память",
                  [
                    ["Встроенная", "128ГБ"],
                    ["Оперативная", "8ГБ"],
                  ],
                ],
                [
                  "Камера",
                  [
                    ["Основная", "32МП"],
                    ["Фронтальная", "14МП"],
                  ],
                ],
                [
                  "Беспроводные технологии",
                  [
                    [
                      "Коммуникации",
                      "Bluetooth; NFC; GPS; USB Type-C; BDS; Wi-F",
                    ],
                    ["Версия Bluetooth", "5.3"],
                  ],
                ],
                [
                  "Аккумулятор",
                  [
                    ["Тип", "Li-Ion"],
                    ["Емкость", "8000мАг"],
                    [
                      "Технологии зарядки",
                      "быстрая зарядка; реверсивная зарядка",
                    ],
                  ],
                ],
                [
                  "Корпус",
                  [
                    [
                      "Датчики",
                      "акселерометр; барометр; гироскоп; датчик освещенности; датчик приближения; компас",
                    ],
                    ["Безопасность", "сканер отпечатков пальцев на экране"],
                    ["Цвет", "черный"],
                    ["Материал задней крышки", "метал"],
                    ["Стандарт защиты", "IP67"],
                  ],
                ],
                [
                  "Размеры",
                  [
                    ["Габариты", "165.8 x 254.3 x 6.5мм"],
                    ["Вес", "465г"],
                  ],
                ],
                [
                  "Дополнительно",
                  [
                    ["Гарантия", "12 месяцев"],
                    ["Оплата", "Оплата при получении товара"],
                  ],
                ],
              ],
            },
          },
        ],
      },
    },
    // Galaxy Tab 10 Pro
    {
      slug: "samsung-tab-10-pro",
      model: "Galaxy Tab 10 Pro",
      fullName: "Galaxy Tab 10 Pro",
      category: Category.tablet,
      brand: Brand.Samsung,
      images: [
        "/images/products/tablets/galaxy-tab-10-pro/preview.png",
        "/images/products/tablets/galaxy-tab-10-pro/1.jpg",
        "/images/products/tablets/galaxy-tab-10-pro/2.jpg",
        "/images/products/tablets/galaxy-tab-10-pro/3.jpg",
        "/images/products/tablets/galaxy-tab-10-pro/4.jpg",
      ],
      price: 4440,
      isNew: true,
      isBestseller: true,
      inStock: true,
      translations: {
        create: [
          // Український переклад
          {
            locale: "uk",
            descriptionInfo: {
              description: [
                [
                  "Основні",
                  [
                    ["Модель", "Galaxy Tab 10 Pro"],
                    ["Операційна система", "Android 13"],
                    ["Рік випуску", "2023"],
                  ],
                ],
                [
                  "Звя'зок",
                  [
                    ["Інтернет", "4G (LTE), 3G"],
                    ["Кількість SIM", "1"],
                    ["Тип SIM", "Nano-SIM"],
                  ],
                ],
                [
                  "Екран",
                  [
                    ["Діагональ", '10"'],
                    ["Матриця", "AMOLED"],
                    ["Роздільна здатність", "1920x1080"],
                    ["Частота оновлення", "90Гц"],
                  ],
                ],
                [
                  "Процесор",
                  [
                    ["Модель", "Exynos 1180"],
                    ["Ядра", "8"],
                    ["Максимальна частота", "2.8 ГГц"],
                  ],
                ],
                [
                  "Пам'ять",
                  [
                    ["Вбудована", "64ГБ"],
                    ["Оперативна", "6ГБ"],
                  ],
                ],
                [
                  "Камера",
                  [
                    ["Основна", "18МП"],
                    ["Фронтальна", "12МП"],
                  ],
                ],
                [
                  "Бездротові технології",
                  [
                    [
                      "Комунікації",
                      "Bluetooth; NFC; GPS; USB Type-C; BDS; Wi-F",
                    ],
                    ["Версія Bluetooth", "5.3"],
                  ],
                ],
                [
                  "Акумулятор",
                  [
                    ["Тип", "Li-Ion"],
                    ["Ємність", "7500мАг"],
                    [
                      "Технології зарядки",
                      "швидка зарядка; реверсивна зарядка",
                    ],
                  ],
                ],
                [
                  "Корпус",
                  [
                    [
                      "Датчики",
                      "акселерометр; барометр; гіроскоп; датчик освітлення; датчик наближення; компас",
                    ],
                    ["Безпека", " сканер відбитків пальців на екрані"],
                    ["Колір", "чорний"],
                    ["Матеріал задньої кришки", "метал"],
                    ["Стандарт захисту", "IP67"],
                  ],
                ],
                [
                  "Розміри",
                  [
                    ["Габарити", "165.8 x 254.3 x 6.5мм"],
                    ["Вага", "465г"],
                  ],
                ],
                [
                  "Додатково",
                  [
                    ["Гарантія", "12 місяців"],
                    ["Оплата", "Оплата при отриманні товару"],
                  ],
                ],
              ],
            },
          },
          // Російський переклад
          {
            locale: "ru",
            descriptionInfo: {
              description: [
                [
                  "Основные",
                  [
                    ["Модель", "Galaxy Tab 10 Pro"],
                    ["Операционная система", "Android 13"],
                    ["Год выпуска", "2023"],
                  ],
                ],
                [
                  "Связь",
                  [
                    ["Интернет", "4G (LTE), 3G"],
                    ["Количество SIM", "1"],
                    ["Тип SIM", "Nano-SIM"],
                  ],
                ],
                [
                  "Экран",
                  [
                    ["Диагональ", '10"'],
                    ["Матрица", "AMOLED"],
                    ["Разрешение", "1920x1080"],
                    ["Частота обновления", "90Гц"],
                  ],
                ],
                [
                  "Процессор",
                  [
                    ["Модель", "Exynos 1180"],
                    ["Ядра", "8"],
                    ["Максимальная частота", "2.8 ГГц"],
                  ],
                ],
                [
                  "Память",
                  [
                    ["Встроенная", "64ГБ"],
                    ["Оперативная", "6ГБ"],
                  ],
                ],
                [
                  "Камера",
                  [
                    ["Основная", "18МП"],
                    ["Фронтальная", "12МП"],
                  ],
                ],
                [
                  "Беспроводные технологии",
                  [
                    [
                      "Коммуникации",
                      "Bluetooth; NFC; GPS; USB Type-C; BDS; Wi-F",
                    ],
                    ["Версия Bluetooth", "5.3"],
                  ],
                ],
                [
                  "Аккумулятор",
                  [
                    ["Тип", "Li-Ion"],
                    ["Емкость", "7500мАг"],
                    [
                      "Технологии зарядки",
                      "быстрая зарядка; реверсивная зарядка",
                    ],
                  ],
                ],
                [
                  "Корпус",
                  [
                    [
                      "Датчики",
                      "акселерометр; барометр; гироскоп; датчик освещенности; датчик приближения; компас",
                    ],
                    ["Безопасность", "сканер отпечатков пальцев на экране"],
                    ["Цвет", "черный"],
                    ["Материал задней крышки", "метал"],
                    ["Стандарт защиты", "IP67"],
                  ],
                ],
                [
                  "Размеры",
                  [
                    ["Габариты", "165.8 x 254.3 x 6.5мм"],
                    ["Вес", "465г"],
                  ],
                ],
                [
                  "Дополнительно",
                  [
                    ["Гарантия", "12 месяцев"],
                    ["Оплата", "Оплата при получении товара"],
                  ],
                ],
              ],
            },
          },
        ],
      },
    },
    // Huawei Pura 70 Pro 16/1024gb
    {
      slug: "huawei-pura-70-pro-1024",
      model: "Huawei Pura 70 Pro",
      fullName: "Huawei Pura 70 Pro 16/1024gb",
      category: Category.phone,
      brand: Brand.Huawei,
      images: [
        "/images/products/phones/huawei-pura-70-pro/huawei-pura-70-pro-1024/preview.png",
        "/images/products/phones/huawei-pura-70-pro/huawei-pura-70-pro-1024/1.jpeg",
        "/images/products/phones/huawei-pura-70-pro/huawei-pura-70-pro-1024/2.jpeg",
        "/images/products/phones/huawei-pura-70-pro/huawei-pura-70-pro-1024/3.jpeg",
        "/images/products/phones/huawei-pura-70-pro/huawei-pura-70-pro-1024/4.jpeg",
      ],
      price: 6990,
      memory: 1024,
      isNew: true,
      isBestseller: false,
      inStock: true,
      translations: {
        create: [
          // Український переклад
          {
            locale: "uk",
            descriptionInfo: {
              description: [
                [
                  "Основні",
                  [
                    ["Модель", "Pura 70 Pro"],
                    ["Операційна система", "Android 14"],
                    ["Рік випуску", "2024"],
                  ],
                ],
                [
                  "Звя'зок",
                  [
                    ["Інтернет", "5G, 4G (LTE)"],
                    ["Кількість SIM", "2"],
                    ["Тип SIM", "Nano-SIM; eSIM"],
                  ],
                ],
                [
                  "Екран",
                  [
                    ["Діагональ", '6.8"'],
                    ["Матриця", "OLED (LTPO)"],
                    ["Роздільна здатність", "2844x1260"],
                    ["Частота оновлення", "120Гц"],
                  ],
                ],
                [
                  "Процесор",
                  [
                    ["Модель", "Kirin 9010"],
                    ["Ядра", "12"],
                    ["Максимальна частота", "3.6 ГГц"],
                  ],
                ],
                [
                  "Пам'ять",
                  [
                    ["Вбудована", "1024ГБ"],
                    ["Оперативна", "16ГБ"],
                  ],
                ],
                [
                  "Камера",
                  [
                    ["Основна", "120МП"],
                    ["Фронтальна", "48МП"],
                  ],
                ],
                [
                  "Бездротові технології",
                  [
                    [
                      "Комунікації",
                      "Bluetooth; NFC; GPS; USB Type-C; BDS; Wi-F",
                    ],
                    ["Версія Bluetooth", "5.3"],
                  ],
                ],
                [
                  "Акумулятор",
                  [
                    ["Тип", "Li-Ion"],
                    ["Ємність", "5050мАг"],
                    [
                      "Технології зарядки",
                      "бездротова зарядка; швидка зарядка; реверсивна зарядка",
                    ],
                  ],
                ],
                [
                  "Корпус",
                  [
                    [
                      "Датчики",
                      "акселерометр; барометр; гіроскоп; датчик освітлення; датчик наближення; компас",
                    ],
                    [
                      "Безпека",
                      "розпізнавання особи; сканер відбитків пальців на екрані",
                    ],
                    ["Колір", "чорний, зелений"],
                    ["Матеріал задньої кришки", "скло"],
                    ["Стандарт захисту", "IP68"],
                  ],
                ],
                [
                  "Розміри",
                  [
                    ["Габарити", "162.6 x 75.1 x 8.4мм"],
                    ["Вага", "220г"],
                  ],
                ],
                [
                  "Додатково",
                  [
                    ["Гарантія", "12 місяців"],
                    ["Оплата", "Оплата при отриманні товару"],
                  ],
                ],
              ],
            },
          },
          // Російський переклад
          {
            locale: "ru",
            descriptionInfo: {
              description: [
                [
                  "Основные",
                  [
                    ["Модель", "Pura 70 Pro"],
                    ["Операционная система", "Android 14"],
                    ["Год выпуска", "2024"],
                  ],
                ],
                [
                  "Связь",
                  [
                    ["Интернет", "5G, 4G (LTE)"],
                    ["Количество SIM", "2"],
                    ["Тип SIM", "Nano-SIM; eSIM"],
                  ],
                ],
                [
                  "Экран",
                  [
                    ["Диагональ", '6.8"'],
                    ["Матрица", "OLED (LTPO)"],
                    ["Разрешение", "2844x1260"],
                    ["Частота обновления", "120Гц"],
                  ],
                ],
                [
                  "Процессор",
                  [
                    ["Модель", "Kirin 9010"],
                    ["Ядра", "12"],
                    ["Максимальная частота", "3.6 ГГц"],
                  ],
                ],
                [
                  "Память",
                  [
                    ["Встроенная", "1024ГБ"],
                    ["Оперативная", "16ГБ"],
                  ],
                ],
                [
                  "Камера",
                  [
                    ["Основная", "120МП"],
                    ["Фронтальная", "48МП"],
                  ],
                ],
                [
                  "Беспроводные технологии",
                  [
                    [
                      "Коммуникации",
                      "Bluetooth; NFC; GPS; USB Type-C; BDS; Wi-F",
                    ],
                    ["Версия Bluetooth", "5.3"],
                  ],
                ],
                [
                  "Аккумулятор",
                  [
                    ["Тип", "Li-Ion"],
                    ["Емкость", "5050мАг"],
                    [
                      "Технологии зарядки",
                      "беспроводная зарядка; быстрая зарядка; реверсивная зарядка",
                    ],
                  ],
                ],
                [
                  "Корпус",
                  [
                    [
                      "Датчики",
                      "акселерометр; барометр; гироскоп; датчик освещенности; датчик приближения; компас",
                    ],
                    [
                      "Безопасность",
                      "распознавание лица; сканер отпечатков пальцев на экране",
                    ],
                    ["Цвет", "черный, зеленый"],
                    ["Материал задней крышки", "стекло"],
                    ["Стандарт защиты", "IP68"],
                  ],
                ],
                [
                  "Размеры",
                  [
                    ["Габариты", "162.6 x 75.1 x 8.4мм"],
                    ["Вес", "220г"],
                  ],
                ],
                [
                  "Дополнительно",
                  [
                    ["Гарантия", "12 месяцев"],
                    ["Оплата", "Оплата при получении товара"],
                  ],
                ],
              ],
            },
          },
        ],
      },
    },
    // Huawei Pura 70 Pro 12/512gb
    {
      slug: "huawei-pura-70-pro-512",
      model: "Huawei Pura 70 Pro",
      fullName: "Huawei Pura 70 Pro 12/512gb",
      category: Category.phone,
      brand: Brand.Huawei,
      images: [
        "/images/products/phones/huawei-pura-70-pro/huawei-pura-70-pro-512/preview.png",
        "/images/products/phones/huawei-pura-70-pro/huawei-pura-70-pro-512/1.jpeg",
        "/images/products/phones/huawei-pura-70-pro/huawei-pura-70-pro-512/2.jpeg",
        "/images/products/phones/huawei-pura-70-pro/huawei-pura-70-pro-512/3.jpeg",
        "/images/products/phones/huawei-pura-70-pro/huawei-pura-70-pro-512/4.jpeg",
      ],
      price: 6440,
      memory: 512,
      isNew: true,
      isBestseller: false,
      inStock: true,
      translations: {
        create: [
          // Український переклад
          {
            locale: "uk",
            descriptionInfo: {
              description: [
                [
                  "Основні",
                  [
                    ["Модель", "Pura 70 Pro"],
                    ["Операційна система", "Android 14"],
                    ["Рік випуску", "2024"],
                  ],
                ],
                [
                  "Звя'зок",
                  [
                    ["Інтернет", "5G, 4G (LTE)"],
                    ["Кількість SIM", "2"],
                    ["Тип SIM", "Nano-SIM; eSIM"],
                  ],
                ],
                [
                  "Екран",
                  [
                    ["Діагональ", '6.8"'],
                    ["Матриця", "OLED (LTPO)"],
                    ["Роздільна здатність", "2844x1260"],
                    ["Частота оновлення", "120Гц"],
                  ],
                ],
                [
                  "Процесор",
                  [
                    ["Модель", "Kirin 9010"],
                    ["Ядра", "12"],
                    ["Максимальна частота", "3.6 ГГц"],
                  ],
                ],
                [
                  "Пам'ять",
                  [
                    ["Вбудована", "512ГБ"],
                    ["Оперативна", "12ГБ"],
                  ],
                ],
                [
                  "Камера",
                  [
                    ["Основна", "120МП"],
                    ["Фронтальна", "48МП"],
                  ],
                ],
                [
                  "Бездротові технології",
                  [
                    [
                      "Комунікації",
                      "Bluetooth; NFC; GPS; USB Type-C; BDS; Wi-F",
                    ],
                    ["Версія Bluetooth", "5.3"],
                  ],
                ],
                [
                  "Акумулятор",
                  [
                    ["Тип", "Li-Ion"],
                    ["Ємність", "5050мАг"],
                    [
                      "Технології зарядки",
                      "бездротова зарядка; швидка зарядка; реверсивна зарядка",
                    ],
                  ],
                ],
                [
                  "Корпус",
                  [
                    [
                      "Датчики",
                      "акселерометр; барометр; гіроскоп; датчик освітлення; датчик наближення; компас",
                    ],
                    [
                      "Безпека",
                      "розпізнавання особи; сканер відбитків пальців на екрані",
                    ],
                    ["Колір", "чорний, зелений"],
                    ["Матеріал задньої кришки", "скло"],
                    ["Стандарт захисту", "IP68"],
                  ],
                ],
                [
                  "Розміри",
                  [
                    ["Габарити", "162.6 x 75.1 x 8.4мм"],
                    ["Вага", "220г"],
                  ],
                ],
                [
                  "Додатково",
                  [
                    ["Гарантія", "12 місяців"],
                    ["Оплата", "Оплата при отриманні товару"],
                  ],
                ],
              ],
            },
          },
          // Російський переклад
          {
            locale: "ru",
            descriptionInfo: {
              description: [
                [
                  "Основные",
                  [
                    ["Модель", "Pura 70 Pro"],
                    ["Операционная система", "Android 14"],
                    ["Год выпуска", "2024"],
                  ],
                ],
                [
                  "Связь",
                  [
                    ["Интернет", "5G, 4G (LTE)"],
                    ["Количество SIM", "2"],
                    ["Тип SIM", "Nano-SIM; eSIM"],
                  ],
                ],
                [
                  "Экран",
                  [
                    ["Диагональ", '6.8"'],
                    ["Матрица", "OLED (LTPO)"],
                    ["Разрешение", "2844x1260"],
                    ["Частота обновления", "120Гц"],
                  ],
                ],
                [
                  "Процессор",
                  [
                    ["Модель", "Kirin 9010"],
                    ["Ядра", "12"],
                    ["Максимальная частота", "3.6 ГГц"],
                  ],
                ],
                [
                  "Память",
                  [
                    ["Встроенная", "512ГБ"],
                    ["Оперативная", "12ГБ"],
                  ],
                ],
                [
                  "Камера",
                  [
                    ["Основная", "120МП"],
                    ["Фронтальная", "48МП"],
                  ],
                ],
                [
                  "Беспроводные технологии",
                  [
                    [
                      "Коммуникации",
                      "Bluetooth; NFC; GPS; USB Type-C; BDS; Wi-F",
                    ],
                    ["Версия Bluetooth", "5.3"],
                  ],
                ],
                [
                  "Аккумулятор",
                  [
                    ["Тип", "Li-Ion"],
                    ["Емкость", "5050мАг"],
                    [
                      "Технологии зарядки",
                      "беспроводная зарядка; быстрая зарядка; реверсивная зарядка",
                    ],
                  ],
                ],
                [
                  "Корпус",
                  [
                    [
                      "Датчики",
                      "акселерометр; барометр; гироскоп; датчик освещенности; датчик приближения; компас",
                    ],
                    [
                      "Безопасность",
                      "распознавание лица; сканер отпечатков пальцев на экране",
                    ],
                    ["Цвет", "черный, зеленый"],
                    ["Материал задней крышки", "стекло"],
                    ["Стандарт защиты", "IP68"],
                  ],
                ],
                [
                  "Размеры",
                  [
                    ["Габариты", "162.6 x 75.1 x 8.4мм"],
                    ["Вес", "220г"],
                  ],
                ],
                [
                  "Дополнительно",
                  [
                    ["Гарантия", "12 месяцев"],
                    ["Оплата", "Оплата при получении товара"],
                  ],
                ],
              ],
            },
          },
        ],
      },
    },
    // Huawei Pura 70 Pro 12/256gb
    {
      slug: "huawei-pura-70-pro-256",
      model: "Huawei Pura 70 Pro",
      fullName: "Huawei Pura 70 Pro 12/256gb",
      category: Category.phone,
      brand: Brand.Huawei,
      images: [
        "/images/products/phones/huawei-pura-70-pro/huawei-pura-70-pro-256/preview.png",
        "/images/products/phones/huawei-pura-70-pro/huawei-pura-70-pro-256/1.jpeg",
        "/images/products/phones/huawei-pura-70-pro/huawei-pura-70-pro-256/2.jpeg",
        "/images/products/phones/huawei-pura-70-pro/huawei-pura-70-pro-256/3.jpeg",
        "/images/products/phones/huawei-pura-70-pro/huawei-pura-70-pro-256/4.jpeg",
      ],
      price: 5990,
      memory: 256,
      isNew: true,
      isBestseller: false,
      inStock: true,
      translations: {
        create: [
          // Український переклад
          {
            locale: "uk",
            descriptionInfo: {
              description: [
                [
                  "Основні",
                  [
                    ["Модель", "Pura 70 Pro"],
                    ["Операційна система", "Android 14"],
                    ["Рік випуску", "2024"],
                  ],
                ],
                [
                  "Звя'зок",
                  [
                    ["Інтернет", "5G, 4G (LTE)"],
                    ["Кількість SIM", "2"],
                    ["Тип SIM", "Nano-SIM; eSIM"],
                  ],
                ],
                [
                  "Екран",
                  [
                    ["Діагональ", '6.8"'],
                    ["Матриця", "OLED (LTPO)"],
                    ["Роздільна здатність", "2844x1260"],
                    ["Частота оновлення", "120Гц"],
                  ],
                ],
                [
                  "Процесор",
                  [
                    ["Модель", "Kirin 9000"],
                    ["Ядра", "10"],
                    ["Максимальна частота", "3.3 ГГц"],
                  ],
                ],
                [
                  "Пам'ять",
                  [
                    ["Вбудована", "256ГБ"],
                    ["Оперативна", "12ГБ"],
                  ],
                ],
                [
                  "Камера",
                  [
                    ["Основна", "120МП"],
                    ["Фронтальна", "48МП"],
                  ],
                ],
                [
                  "Бездротові технології",
                  [
                    [
                      "Комунікації",
                      "Bluetooth; NFC; GPS; USB Type-C; BDS; Wi-F",
                    ],
                    ["Версія Bluetooth", "5.3"],
                  ],
                ],
                [
                  "Акумулятор",
                  [
                    ["Тип", "Li-Ion"],
                    ["Ємність", "5050мАг"],
                    [
                      "Технології зарядки",
                      "бездротова зарядка; швидка зарядка; реверсивна зарядка",
                    ],
                  ],
                ],
                [
                  "Корпус",
                  [
                    [
                      "Датчики",
                      "акселерометр; барометр; гіроскоп; датчик освітлення; датчик наближення; компас",
                    ],
                    [
                      "Безпека",
                      "розпізнавання особи; сканер відбитків пальців на екрані",
                    ],
                    ["Колір", "чорний, зелений"],
                    ["Матеріал задньої кришки", "скло"],
                    ["Стандарт захисту", "IP68"],
                  ],
                ],
                [
                  "Розміри",
                  [
                    ["Габарити", "162.6 x 75.1 x 8.4мм"],
                    ["Вага", "220г"],
                  ],
                ],
                [
                  "Додатково",
                  [
                    ["Гарантія", "12 місяців"],
                    ["Оплата", "Оплата при отриманні товару"],
                  ],
                ],
              ],
            },
          },
          // Російський переклад
          {
            locale: "ru",
            descriptionInfo: {
              description: [
                [
                  "Основные",
                  [
                    ["Модель", "Pura 70 Pro"],
                    ["Операционная система", "Android 14"],
                    ["Год выпуска", "2024"],
                  ],
                ],
                [
                  "Связь",
                  [
                    ["Интернет", "5G, 4G (LTE)"],
                    ["Количество SIM", "2"],
                    ["Тип SIM", "Nano-SIM; eSIM"],
                  ],
                ],
                [
                  "Экран",
                  [
                    ["Диагональ", '6.8"'],
                    ["Матрица", "OLED (LTPO)"],
                    ["Разрешение", "2844x1260"],
                    ["Частота обновления", "120Гц"],
                  ],
                ],
                [
                  "Процессор",
                  [
                    ["Модель", "Kirin 9000"],
                    ["Ядра", "10"],
                    ["Максимальная частота", "3.3 ГГц"],
                  ],
                ],
                [
                  "Память",
                  [
                    ["Встроенная", "256ГБ"],
                    ["Оперативная", "12ГБ"],
                  ],
                ],
                [
                  "Камера",
                  [
                    ["Основная", "120МП"],
                    ["Фронтальная", "48МП"],
                  ],
                ],
                [
                  "Беспроводные технологии",
                  [
                    [
                      "Коммуникации",
                      "Bluetooth; NFC; GPS; USB Type-C; BDS; Wi-F",
                    ],
                    ["Версия Bluetooth", "5.3"],
                  ],
                ],
                [
                  "Аккумулятор",
                  [
                    ["Тип", "Li-Ion"],
                    ["Емкость", "5050мАг"],
                    [
                      "Технологии зарядки",
                      "беспроводная зарядка; быстрая зарядка; реверсивная зарядка",
                    ],
                  ],
                ],
                [
                  "Корпус",
                  [
                    [
                      "Датчики",
                      "акселерометр; барометр; гироскоп; датчик освещенности; датчик приближения; компас",
                    ],
                    [
                      "Безопасность",
                      "распознавание лица; сканер отпечатков пальцев на экране",
                    ],
                    ["Цвет", "черный, зеленый"],
                    ["Материал задней крышки", "стекло"],
                    ["Стандарт защиты", "IP68"],
                  ],
                ],
                [
                  "Размеры",
                  [
                    ["Габариты", "162.6 x 75.1 x 8.4мм"],
                    ["Вес", "220г"],
                  ],
                ],
                [
                  "Дополнительно",
                  [
                    ["Гарантия", "12 месяцев"],
                    ["Оплата", "Оплата при получении товара"],
                  ],
                ],
              ],
            },
          },
        ],
      },
    },
    // Samsung S23 Ultra 12/256gb
    {
      slug: "samsung-23-ultra-256",
      model: "Samsung S23 Ultra",
      fullName: "Samsung S23 Ultra 12/256gb",
      category: Category.phone,
      brand: Brand.Samsung,
      images: [
        "/images/products/phones/s23-ultra/s23-ultra-256/preview.png",
        "/images/products/phones/s23-ultra/s23-ultra-256/1.jpg",
        "/images/products/phones/s23-ultra/s23-ultra-256/2.jpg",
        "/images/products/phones/s23-ultra/s23-ultra-256/3.jpg",
        "/images/products/phones/s23-ultra/s23-ultra-256/4.jpg",
        "/images/products/phones/s23-ultra/s23-ultra-256/5.jpg",
      ],
      price: 4990,
      isNew: true,
      isBestseller: true,
      inStock: true,
      translations: {
        create: [
          // Український переклад
          {
            locale: "uk",
            descriptionInfo: {
              description: [
                [
                  "Основні",
                  [
                    ["Модель", "Samsung S23 Ultra"],
                    ["Операційна система", "Android 13"],
                    ["Рік випуску", "2023"],
                  ],
                ],
                [
                  "Звя'зок",
                  [
                    ["Інтернет", "5G, 4G (LTE)"],
                    ["Кількість SIM", "2"],
                    ["Тип SIM", "Nano-SIM; eSIM"],
                  ],
                ],
                [
                  "Екран",
                  [
                    ["Діагональ", '6.8"'],
                    ["Матриця", "AMOLED X"],
                    ["Роздільна здатність", "3120x1440"],
                    ["Частота оновлення", "120Гц"],
                  ],
                ],
                [
                  "Процесор",
                  [
                    ["Модель", "Snapdragon 8 Gen 2"],
                    ["Ядра", "12"],
                    ["Максимальна частота", "2.3 ГГц"],
                  ],
                ],
                [
                  "Пам'ять",
                  [
                    ["Вбудована", "256ГБ"],
                    ["Оперативна", "12ГБ"],
                  ],
                ],
                [
                  "Камера",
                  [
                    ["Основна", "200МП"],
                    ["Фронтальна", "12МП"],
                  ],
                ],
                [
                  "Бездротові технології",
                  [
                    [
                      "Комунікації",
                      "Bluetooth; NFC; GPS; USB Type-C; BDS; Wi-F",
                    ],
                    ["Версія Bluetooth", "5.3"],
                  ],
                ],
                [
                  "Акумулятор",
                  [
                    ["Тип", "Li-Ion"],
                    ["Ємність", "5000мАг"],
                    [
                      "Технології зарядки",
                      "бездротова зарядка; швидка зарядка; реверсивна зарядка",
                    ],
                  ],
                ],
                [
                  "Корпус",
                  [
                    [
                      "Датчики",
                      "акселерометр; барометр; гіроскоп; датчик освітлення; датчик наближення; компас",
                    ],
                    [
                      "Безпека",
                      "розпізнавання особи; сканер відбитків пальців на екрані",
                    ],
                    ["Колір", "чорний"],
                    ["Матеріал задньої кришки", "скло"],
                    ["Стандарт захисту", "IP68"],
                  ],
                ],
                [
                  "Розміри",
                  [
                    ["Габарити", "162.3 x 79.0 x 8.6мм"],
                    ["Вага", "232г"],
                  ],
                ],
                [
                  "Додатково",
                  [
                    ["Гарантія", "12 місяців"],
                    ["Оплата", "Оплата при отриманні товару"],
                  ],
                ],
              ],
            },
          },
          // Російський переклад
          {
            locale: "ru",
            descriptionInfo: {
              description: [
                [
                  "Основные",
                  [
                    ["Модель", "Samsung S23 Ultra"],
                    ["Операционная система", "Android 13"],
                    ["Год выпуска", "2023"],
                  ],
                ],
                [
                  "Связь",
                  [
                    ["Интернет", "5G, 4G (LTE)"],
                    ["Количество SIM", "2"],
                    ["Тип SIM", "Nano-SIM; eSIM"],
                  ],
                ],
                [
                  "Экран",
                  [
                    ["Диагональ", '6.8"'],
                    ["Матрица", "AMOLED X"],
                    ["Разрешение", "3120x1440"],
                    ["Частота обновления", "120Гц"],
                  ],
                ],
                [
                  "Процессор",
                  [
                    ["Модель", "Snapdragon 8 Gen 2"],
                    ["Ядра", "12"],
                    ["Максимальная частота", "2.3 ГГц"],
                  ],
                ],
                [
                  "Память",
                  [
                    ["Встроенная", "256ГБ"],
                    ["Оперативная", "12ГБ"],
                  ],
                ],
                [
                  "Камера",
                  [
                    ["Основная", "200МП"],
                    ["Фронтальная", "12МП"],
                  ],
                ],
                [
                  "Беспроводные технологии",
                  [
                    [
                      "Коммуникации",
                      "Bluetooth; NFC; GPS; USB Type-C; BDS; Wi-F",
                    ],
                    ["Версия Bluetooth", "5.3"],
                  ],
                ],
                [
                  "Аккумулятор",
                  [
                    ["Тип", "Li-Ion"],
                    ["Емкость", "5000мАг"],
                    [
                      "Технологии зарядки",
                      "беспроводная зарядка; быстрая зарядка; реверсивная зарядка",
                    ],
                  ],
                ],
                [
                  "Корпус",
                  [
                    [
                      "Датчики",
                      "акселерометр; барометр; гироскоп; датчик освещенности; датчик приближения; компас",
                    ],
                    [
                      "Безопасность",
                      "распознавание лица; сканер отпечатков пальцев на экране",
                    ],
                    ["Цвет", "черный"],
                    ["Материал задней крышки", "стекло"],
                    ["Стандарт защиты", "IP68"],
                  ],
                ],
                [
                  "Размеры",
                  [
                    ["Габариты", "162.3 x 79.0 x 8.6мм"],
                    ["Вес", "232г"],
                  ],
                ],
                [
                  "Дополнительно",
                  [
                    ["Гарантия", "12 месяцев"],
                    ["Оплата", "Оплата при получении товара"],
                  ],
                ],
              ],
            },
          },
        ],
      },
    },
    // Samsung Smart TV 32' 2025 4K
    {
      slug: "samsung-tv-32",
      model: "Samsung Smart TV",
      fullName: "Samsung Smart TV 32' 2025 4K",
      category: Category.tv,
      brand: Brand.Samsung,
      images: [
        "/images/products/tv/samsung-tv/samsung-tv-32/preview.png",
        "/images/products/tv/samsung-tv/samsung-tv-32/1.jpeg",
        "/images/products/tv/samsung-tv/samsung-tv-32/2.jpeg",
        "/images/products/tv/samsung-tv/samsung-tv-32/3.jpeg",
      ],
      price: 5990,
      isNew: true,
      isBestseller: false,
      inStock: true,
      translations: {
        create: [
          // Український переклад
          {
            locale: "uk",
            descriptionInfo: {
              description: [
                [
                  "Основні",
                  [
                    ["Модель", "Samsung Smart TV 2025 4K"],
                    ["Операційна система", "Android 15"],
                    ["Рік випуску", "2025"],
                    ["Розширення", "3840х2160 UHD"],
                    ["Колір рамки", "чорний"],
                    ["Процесор", "4 ядра"],
                    ["Вбудована пам'ять", "16ГБ"],
                    ["Оперативна пам'ять", "1.5ГБ"],
                  ],
                ],
                [
                  "Зображення",
                  [
                    ["Контрасність", "Mega Contrast"],
                    ["Частота розгортки", "200Гц"],
                    [
                      "Технології, що покращують зображення",
                      "HDR, PureColor, Micro Dimming Pro, Contrast Enhancer",
                    ],
                  ],
                ],
                [
                  "Звук",
                  [
                    ["Сумарна потужність динаміків", "10Вт"],
                    ["Звукові ефекти", "Dolby Digital Plus"],
                  ],
                ],
                [
                  "Функції та можливості",
                  [
                    ["Бездротові комунікації", "DLNA; Wi-Fi Direct Wi-Fi;"],
                    ["Вбудовані тюнери", "DVB-C; DVB-T2; DVB-S2; аналоговий"],
                    ["Стандарт кріплення VESA", "100 x 100"],
                  ],
                ],
                [
                  "Інтерфейси",
                  [
                    [
                      "Роз'єми",
                      "HDMI 2.0; компонентний (Y/Pb/Pr); композитний (AV); USB; LAN (Ethernet); CI; оптичний (цифровий); антенний вхід (RF); для супутникової антени",
                    ],
                    ["USB роз'ємів", "1"],
                    ["HDMI 2.0 роз'ємів", "2"],
                  ],
                ],
                [
                  "Вага та габарити",
                  [
                    [
                      "Габарити без підставки (ШхВхГ)",
                      "737.4 x 438.0 x 74.1мм",
                    ],
                    [
                      "Габарити із підставкою (ШхВхГ)",
                      "737.4 x 465.4 x 150.5мм",
                    ],
                    ["Вес без подставки", "4кг"],
                    ["Вага з підставкою", "4.1кг"],
                  ],
                ],
                [
                  "Додатково",
                  [
                    ["Гарантія", "12 місяців"],
                    ["Оплата", "Оплата при отриманні товару"],
                  ],
                ],
              ],
            },
          },
          // Російський переклад
          {
            locale: "ru",
            descriptionInfo: {
              description: [
                [
                  "Основные",
                  [
                    ["Модель", "Samsung Smart TV 2025 4K"],
                    ["Операционная система", "Android 15"],
                    ["Год выпуска", "2025"],
                    ["Разрешение", "3840х2160 UHD"],
                    ["Цвет рамки", "черный"],
                    ["Процессор", "4 ядра"],
                    ["Встроенная память", "16ГБ"],
                    ["Оперативная память", "1.5ГБ"],
                  ],
                ],
                [
                  "Изображение",
                  [
                    ["Контрастность", "Mega Contrast"],
                    ["Частота развертки", "200Гц"],
                    [
                      "Технологии улучшения изображения",
                      "HDR, PureColor, Micro Dimming Pro, Contrast Enhancer",
                    ],
                  ],
                ],
                [
                  "Звук",
                  [
                    ["Суммарная мощность динамиков", "10Вт"],
                    ["Звуковые эффекты", "Dolby Digital Plus"],
                  ],
                ],
                [
                  "Функции и возможности",
                  [
                    ["Беспроводные коммуникации", "DLNA; Wi-Fi Direct Wi-Fi;"],
                    ["Встроенные тюнеры", "DVB-C; DVB-T2; DVB-S2; аналоговый"],
                    ["Стандарт крепления VESA", "100 x 100"],
                  ],
                ],
                [
                  "Интерфейсы",
                  [
                    [
                      "Разъемы",
                      "HDMI 2.0; компонентный (Y/Pb/Pr); композитный (AV); USB; LAN (Ethernet); CI; оптический (цифровой); антенный вход (RF); для спутниковой антенны",
                    ],
                    ["USB разъемов", "1"],
                    ["HDMI 2.0 разъемов", "2"],
                  ],
                ],
                [
                  "Вес и габариты",
                  [
                    [
                      "Габариты без подставки (ШхВхГ)",
                      "737.4 x 438.0 x 74.1мм",
                    ],
                    [
                      "Габариты с подставкой (ШхВхГ)",
                      "737.4 x 465.4 x 150.5мм",
                    ],
                    ["Вес без подставки", "4кг"],
                    ["Вес с подставкой", "4.1кг"],
                  ],
                ],
                [
                  "Дополнительно",
                  [
                    ["Гарантия", "12 месяцев"],
                    ["Оплата", "Оплата при получении товара"],
                  ],
                ],
              ],
            },
          },
        ],
      },
    },
    // Samsung Smart TV 42' 2025 4K
    {
      slug: "samsung-tv-42",
      model: "Samsung Smart TV",
      fullName: "Samsung Smart TV 42' 2025 4K",
      category: Category.tv,
      brand: Brand.Samsung,
      images: [
        "/images/products/tv/samsung-tv/samsung-tv-42/preview.png",
        "/images/products/tv/samsung-tv/samsung-tv-42/1.jpeg",
        "/images/products/tv/samsung-tv/samsung-tv-42/2.jpeg",
        "/images/products/tv/samsung-tv/samsung-tv-42/3.jpeg",
      ],
      price: 7990,
      isNew: true,
      isBestseller: true,
      inStock: true,
      translations: {
        create: [
          // Український переклад
          {
            locale: "uk",
            descriptionInfo: {
              description: [
                [
                  "Основні",
                  [
                    ["Модель", "Samsung Smart TV 2025 4K"],
                    ["Операційна система", "Android 15"],
                    ["Рік випуску", "2025"],
                    ["Розширення", "3840х2160 UHD"],
                    ["Колір рамки", "чорний"],
                    ["Процесор", "4 ядра"],
                    ["Вбудована пам'ять", "16ГБ"],
                    ["Оперативна пам'ять", "1.5ГБ"],
                  ],
                ],
                [
                  "Зображення",
                  [
                    ["Контрасність", "Mega Contrast"],
                    ["Частота розгортки", "200Гц"],
                    [
                      "Технології, що покращують зображення",
                      "Quantum HDR, Supreme UHD Dimming, Contrast Enhancer, Motion Xcelerator, Smart Calibration Basic, 4K Upscaling, Filmmaker Mode",
                    ],
                  ],
                ],
                [
                  "Звук",
                  [
                    ["Сумарна потужність динаміків", "20Вт"],
                    ["Звукові ефекти", "Dolby Digital Plus"],
                  ],
                ],
                [
                  "Функції та можливості",
                  [
                    ["Бездротові комунікації", "DLNA; Wi-Fi Direct Wi-Fi;"],
                    ["Вбудовані тюнери", "DVB-C; DVB-T2; DVB-S2; аналоговий"],
                    ["Стандарт кріплення VESA", "200 x 200"],
                  ],
                ],
                [
                  "Інтерфейси",
                  [
                    [
                      "Роз'єми",
                      "HDMI 2.0; компонентний (Y/Pb/Pr); композитний (AV); USB; LAN (Ethernet); CI; оптичний (цифровий); антенний вхід (RF); для супутникової антени",
                    ],
                    ["USB роз'ємів", "2"],
                    ["HDMI 2.0 роз'ємів", "2"],
                  ],
                ],
                [
                  "Вага та габарити",
                  [
                    [
                      "Габарити без підставки (ШхВхГ)",
                      "965.5 x 559.4 x 25.7мм",
                    ],
                    ["Габарити із підставкою (ШхВхГ)", "965.5 x 598.1 x 181мм"],
                    ["Вес без подставки", "8.4кг"],
                    ["Вага з підставкою", "8.6кг"],
                  ],
                ],
                [
                  "Додатково",
                  [
                    ["Гарантія", "12 місяців"],
                    ["Оплата", "Оплата при отриманні товару"],
                  ],
                ],
              ],
            },
          },
          // Російський переклад
          {
            locale: "ru",
            descriptionInfo: {
              description: [
                [
                  "Основные",
                  [
                    ["Модель", "Samsung Smart TV 2025 4K"],
                    ["Операционная система", "Android 15"],
                    ["Год выпуска", "2025"],
                    ["Разрешение", "3840х2160 UHD"],
                    ["Цвет рамки", "черный"],
                    ["Процессор", "4 ядра"],
                    ["Встроенная память", "16ГБ"],
                    ["Оперативная память", "1.5ГБ"],
                  ],
                ],
                [
                  "Изображение",
                  [
                    ["Контрастность", "Mega Contrast"],
                    ["Частота развертки", "200Гц"],
                    [
                      "Технологии улучшения изображения",
                      "Quantum HDR, Supreme UHD Dimming, Contrast Enhancer, Motion Xcelerator, Smart Calibration Basic, 4K Upscaling, Filmmaker Mode",
                    ],
                  ],
                ],
                [
                  "Звук",
                  [
                    ["Суммарная мощность динамиков", "20Вт"],
                    ["Звуковые эффекты", "Dolby Digital Plus"],
                  ],
                ],
                [
                  "Функции и возможности",
                  [
                    ["Беспроводные коммуникации", "DLNA; Wi-Fi Direct Wi-Fi;"],
                    ["Встроенные тюнеры", "DVB-C; DVB-T2; DVB-S2; аналоговый"],
                    ["Стандарт крепления VESA", "200 x 200"],
                  ],
                ],
                [
                  "Интерфейсы",
                  [
                    [
                      "Разъемы",
                      "HDMI 2.0; компонентный (Y/Pb/Pr); композитный (AV); USB; LAN (Ethernet); CI; оптический (цифровой); антенный вход (RF); для спутниковой антенны",
                    ],
                    ["USB разъемов", "2"],
                    ["HDMI 2.0 разъемов", "2"],
                  ],
                ],
                [
                  "Вес и габариты",
                  [
                    [
                      "Габариты без подставки (ШхВхГ)",
                      "965.5 x 559.4 x 25.7мм",
                    ],
                    ["Габариты с подставкой (ШхВхГ)", "965.5 x 598.1 x 181мм"],
                    ["Вес без подставки", "8.4кг"],
                    ["Вес с подставкой", "8.6кг"],
                  ],
                ],
                [
                  "Дополнительно",
                  [
                    ["Гарантия", "12 месяцев"],
                    ["Оплата", "Оплата при получении товара"],
                  ],
                ],
              ],
            },
          },
        ],
      },
    },
    // Samsung Smart TV 56' 2025 4K
    {
      slug: "samsung-tv-56",
      model: "Samsung Smart TV",
      fullName: "Samsung Smart TV 56' 2025 4K",
      category: Category.tv,
      brand: Brand.Samsung,
      images: [
        "/images/products/tv/samsung-tv/samsung-tv-56/preview.png",
        "/images/products/tv/samsung-tv/samsung-tv-56/1.jpeg",
        "/images/products/tv/samsung-tv/samsung-tv-56/2.jpeg",
        "/images/products/tv/samsung-tv/samsung-tv-56/3.jpeg",
      ],
      price: 14990,
      isNew: true,
      isBestseller: true,
      inStock: true,
      translations: {
        create: [
          // Український переклад
          {
            locale: "uk",
            descriptionInfo: {
              description: [
                [
                  "Основні",
                  [
                    ["Модель", "Samsung Smart TV 2025 4K"],
                    ["Операційна система", "Android 15"],
                    ["Рік випуску", "2025"],
                    ["Розширення", "3840х2160 UHD"],
                    ["Колір рамки", "чорний"],
                    ["Процесор", "4 ядра"],
                    ["Вбудована пам'ять", "16ГБ"],
                    ["Оперативна пам'ять", "1.5ГБ"],
                  ],
                ],
                [
                  "Зображення",
                  [
                    ["Контрасність", "Quantum Processor 4K"],
                    ["Частота розгортки", "200Гц"],
                    [
                      "Технології, що покращують зображення",
                      "Quantum HDR, Supreme UHD Dimming, Motion Xcelerator, FreeSync Premium",
                    ],
                  ],
                ],
                [
                  "Звук",
                  [
                    ["Сумарна потужність динаміків", "20Вт"],
                    ["Звукові ефекти", "Dolby Digital Plus"],
                  ],
                ],
                [
                  "Функції та можливості",
                  [
                    ["Бездротові комунікації", "DLNA; Wi-Fi Direct Wi-Fi;"],
                    ["Вбудовані тюнери", "DVB-C; DVB-T2; DVB-S2; аналоговий"],
                    ["Стандарт кріплення VESA", "200 x 200"],
                  ],
                ],
                [
                  "Інтерфейси",
                  [
                    [
                      "Роз'єми",
                      "HDMI 2.0; компонентний (Y/Pb/Pr); композитний (AV); USB; LAN (Ethernet); CI; оптичний (цифровий); антенний вхід (RF); для супутникової антени",
                    ],
                    ["USB роз'ємів", "2"],
                    ["HDMI 2.0 роз'ємів", "2"],
                  ],
                ],
                [
                  "Вага та габарити",
                  [
                    [
                      "Габарити без підставки (ШхВхГ)",
                      "1237.9 x 708.8 x 24.9мм",
                    ],
                    [
                      "Габарити із підставкою (ШхВхГ)",
                      "1237.9 x 743.4 x 227.8мм",
                    ],
                    ["Вес без подставки", "16.9кг"],
                    ["Вага з підставкою", "17.3кг"],
                  ],
                ],
                [
                  "Додатково",
                  [
                    ["Гарантія", "12 місяців"],
                    ["Оплата", "Оплата при отриманні товару"],
                  ],
                ],
              ],
            },
          },
          // Російський переклад
          {
            locale: "ru",
            descriptionInfo: {
              description: [
                [
                  "Основные",
                  [
                    ["Модель", "Samsung Smart TV 2025 4K"],
                    ["Операционная система", "Android 15"],
                    ["Год выпуска", "2025"],
                    ["Разрешение", "3840х2160 UHD"],
                    ["Цвет рамки", "черный"],
                    ["Процессор", "4 ядра"],
                    ["Встроенная память", "16ГБ"],
                    ["Оперативная память", "1.5ГБ"],
                  ],
                ],
                [
                  "Изображение",
                  [
                    ["Контрастность", "Quantum Processor 4K"],
                    ["Частота развертки", "200Гц"],
                    [
                      "Технологии улучшения изображения",
                      "Quantum HDR, Supreme UHD Dimming, Motion Xcelerator, FreeSync Premium",
                    ],
                  ],
                ],
                [
                  "Звук",
                  [
                    ["Суммарная мощность динамиков", "20Вт"],
                    ["Звуковые эффекты", "Dolby Digital Plus"],
                  ],
                ],
                [
                  "Функции и возможности",
                  [
                    ["Беспроводные коммуникации", "DLNA; Wi-Fi Direct Wi-Fi;"],
                    ["Встроенные тюнеры", "DVB-C; DVB-T2; DVB-S2; аналоговый"],
                    ["Стандарт крепления VESA", "200 x 200"],
                  ],
                ],
                [
                  "Интерфейсы",
                  [
                    [
                      "Разъемы",
                      "HDMI 2.0; компонентный (Y/Pb/Pr); композитный (AV); USB; LAN (Ethernet); CI; оптический (цифровой); антенный вход (RF); для спутниковой антенны",
                    ],
                    ["USB разъемов", "2"],
                    ["HDMI 2.0 разъемов", "2"],
                  ],
                ],
                [
                  "Вес и габариты",
                  [
                    [
                      "Габариты без подставки (ШхВхГ)",
                      "1237.9 x 708.8 x 24.9мм",
                    ],
                    [
                      "Габариты с подставкой (ШхВхГ)",
                      "1237.9 x 743.4 x 227.8мм",
                    ],
                    ["Вес без подставки", "16.9кг"],
                    ["Вес с подставкой", "17.3кг"],
                  ],
                ],
                [
                  "Дополнительно",
                  [
                    ["Гарантия", "12 месяцев"],
                    ["Оплата", "Оплата при получении товара"],
                  ],
                ],
              ],
            },
          },
        ],
      },
    },
  ],
  reviews: [
    // Samsung S24 Ultra - 12/256gb
    {
      author: "Андріана",
      reviewBody:
        "Камера просто вогонь, такої якості ще не бачив. Дисплей неймовірно плавний і яскравий із захистом для очей.",
      rating: 4,
      createdAt: new Date("2025-02-03T14:19:00Z"),
      productSlug: "samsung-s24-ultra-256",
    },
    {
      author: "Світлана",
      reviewBody:
        "Телефон просто супер, дуже гарні знімки в різний час, дуже гучні динаміки, тримати в руках одне задоволення, відгук прекрасний",
      rating: 5,
      createdAt: new Date("2025-01-31T16:14:00Z"),
      productSlug: "samsung-s24-ultra-256",
    },
    {
      author: "Влада",
      reviewBody:
        "Я загалом задоволена цим смартфоном. Він відповідає моїм очікуванням від флагмана цієї марки. Батареї вистачає до кінця дня, залишається близько 60% заряду.",
      rating: 5,
      createdAt: new Date("2024-12-31T18:34:00Z"),
      productSlug: "samsung-s24-ultra-256",
    },
    {
      author: "Дмитро",
      reviewBody:
        "Класний смартфон, все на ньому літає! Міцний дизайн із задньою стороною з матового скла.",
      rating: 5,
      createdAt: new Date("2024-12-14T17:09:00Z"),
      productSlug: "samsung-s24-ultra-256",
    },
    {
      author: "Семен",
      reviewBody:
        "Якщо порівнювати з попередником, то камера стала крутішою, робота телефону більш спритною, збільшилися можливості і покращився екран та звук. Розмір телефону залишився практично незмінним, хоча він став трохи більшим.",
      rating: 5,
      createdAt: new Date("2024-12-13T14:08:00Z"),
      productSlug: "samsung-s24-ultra-256",
    },
    // Samsung S24 Ultra - 12/512gb
    {
      author: "Андріана",
      reviewBody:
        "Камера просто вогонь, такої якості ще не бачив. Дисплей неймовірно плавний і яскравий із захистом для очей.",
      rating: 5,
      createdAt: new Date("2025-02-03T14:19:00Z"),
      productSlug: "samsung-s24-ultra-512",
    },
    {
      author: "Світлана",
      reviewBody:
        "Телефон просто супер, дуже гарні знімки в різний час, дуже гучні динаміки, тримати в руках одне задоволення, відгук прекрасний",
      rating: 5,
      createdAt: new Date("2025-01-31T16:14:00Z"),
      productSlug: "samsung-s24-ultra-512",
    },
    {
      author: "Влада",
      reviewBody:
        "Я загалом задоволена цим смартфоном. Він відповідає моїм очікуванням від флагмана цієї марки. Батареї вистачає до кінця дня, залишається близько 60% заряду.",
      rating: 5,
      createdAt: new Date("2024-12-31T18:34:00Z"),
      productSlug: "samsung-s24-ultra-512",
    },
    {
      author: "Дмитро",
      reviewBody:
        "Класний смартфон, все на ньому літає! Міцний дизайн із задньою стороною з матового скла.",
      rating: 5,
      createdAt: new Date("2024-12-14T17:09:00Z"),
      productSlug: "samsung-s24-ultra-512",
    },
    {
      author: "Семен",
      reviewBody:
        "Якщо порівнювати з попередником, то камера стала крутішою, робота телефону більш спритною, збільшилися можливості і покращився екран та звук. Розмір телефону залишився практично незмінним, хоча він став трохи більшим.",
      rating: 5,
      createdAt: new Date("2024-12-13T14:08:00Z"),
      productSlug: "samsung-s24-ultra-512",
    },
    // Samsung S24 Ultra - 12/1024gb
    {
      author: "Андріана",
      reviewBody:
        "Камера просто вогонь, такої якості ще не бачив. Дисплей неймовірно плавний і яскравий із захистом для очей.",
      rating: 5,
      createdAt: new Date("2025-02-03T14:19:00Z"),
      productSlug: "samsung-s24-ultra-1024",
    },
    {
      author: "Світлана",
      reviewBody:
        "Телефон просто супер, дуже гарні знімки в різний час, дуже гучні динаміки, тримати в руках одне задоволення, відгук прекрасний",
      rating: 5,
      createdAt: new Date("2025-01-31T16:14:00Z"),
      productSlug: "samsung-s24-ultra-1024",
    },
    {
      author: "Влада",
      reviewBody:
        "Я загалом задоволена цим смартфоном. Він відповідає моїм очікуванням від флагмана цієї марки. Батареї вистачає до кінця дня, залишається близько 60% заряду.",
      rating: 5,
      createdAt: new Date("2024-12-31T18:34:00Z"),
      productSlug: "samsung-s24-ultra-1024",
    },
    {
      author: "Дмитро",
      reviewBody:
        "Класний смартфон, все на ньому літає! Міцний дизайн із задньою стороною з матового скла.",
      rating: 5,
      createdAt: new Date("2024-12-14T17:09:00Z"),
      productSlug: "samsung-s24-ultra-1024",
    },
    {
      author: "Семен",
      reviewBody:
        "Якщо порівнювати з попередником, то камера стала крутішою, робота телефону більш спритною, збільшилися можливості і покращився екран та звук. Розмір телефону залишився практично незмінним, хоча він став трохи більшим.",
      rating: 5,
      createdAt: new Date("2024-12-13T14:08:00Z"),
      productSlug: "samsung-s24-ultra-1024",
    },
    // Galaxy Tab 18 Pro
    {
      author: "Андріана",
      reviewBody:
        "Камера просто вогонь, такої якості ще не бачив. Дисплей неймовірно плавний і яскравий із захистом для очей.",
      rating: 5,
      createdAt: new Date("2025-02-03T14:19:00Z"),
      productSlug: "samsung-tab-18-pro",
    },
    {
      author: "Світлана",
      reviewBody:
        "Телефон просто супер, дуже гарні знімки в різний час, дуже гучні динаміки, тримати в руках одне задоволення, відгук прекрасний",
      rating: 5,
      createdAt: new Date("2025-01-31T16:14:00Z"),
      productSlug: "samsung-tab-18-pro",
    },
    {
      author: "Влада",
      reviewBody:
        "Я загалом задоволена цим смартфоном. Він відповідає моїм очікуванням від флагмана цієї марки. Батареї вистачає до кінця дня, залишається близько 60% заряду.",
      rating: 5,
      createdAt: new Date("2024-12-31T18:34:00Z"),
      productSlug: "samsung-tab-18-pro",
    },
    {
      author: "Дмитро",
      reviewBody:
        "Класний смартфон, все на ньому літає! Міцний дизайн із задньою стороною з матового скла.",
      rating: 5,
      createdAt: new Date("2024-12-14T17:09:00Z"),
      productSlug: "samsung-tab-18-pro",
    },
    {
      author: "Семен",
      reviewBody:
        "Якщо порівнювати з попередником, то камера стала крутішою, робота телефону більш спритною, збільшилися можливості і покращився екран та звук. Розмір телефону залишився практично незмінним, хоча він став трохи більшим.",
      rating: 5,
      createdAt: new Date("2024-12-13T14:08:00Z"),
      productSlug: "samsung-tab-18-pro",
    },
    // Galaxy Tab 12 Pro
    {
      author: "Андріана",
      reviewBody:
        "Камера просто вогонь, такої якості ще не бачив. Дисплей неймовірно плавний і яскравий із захистом для очей.",
      rating: 5,
      createdAt: new Date("2025-02-03T14:19:00Z"),
      productSlug: "samsung-tab-12-pro",
    },
    {
      author: "Світлана",
      reviewBody:
        "Телефон просто супер, дуже гарні знімки в різний час, дуже гучні динаміки, тримати в руках одне задоволення, відгук прекрасний",
      rating: 5,
      createdAt: new Date("2025-01-31T16:14:00Z"),
      productSlug: "samsung-tab-12-pro",
    },
    {
      author: "Влада",
      reviewBody:
        "Я загалом задоволена цим смартфоном. Він відповідає моїм очікуванням від флагмана цієї марки. Батареї вистачає до кінця дня, залишається близько 60% заряду.",
      rating: 5,
      createdAt: new Date("2024-12-31T18:34:00Z"),
      productSlug: "samsung-tab-12-pro",
    },
    {
      author: "Дмитро",
      reviewBody:
        "Класний смартфон, все на ньому літає! Міцний дизайн із задньою стороною з матового скла.",
      rating: 5,
      createdAt: new Date("2024-12-14T17:09:00Z"),
      productSlug: "samsung-tab-12-pro",
    },
    {
      author: "Семен",
      reviewBody:
        "Якщо порівнювати з попередником, то камера стала крутішою, робота телефону більш спритною, збільшилися можливості і покращився екран та звук. Розмір телефону залишився практично незмінним, хоча він став трохи більшим.",
      rating: 5,
      createdAt: new Date("2024-12-13T14:08:00Z"),
      productSlug: "samsung-tab-12-pro",
    },
    // Galaxy Tab 10 Pro
    {
      author: "Андріана",
      reviewBody:
        "Камера просто вогонь, такої якості ще не бачив. Дисплей неймовірно плавний і яскравий із захистом для очей.",
      rating: 5,
      createdAt: new Date("2025-02-03T14:19:00Z"),
      productSlug: "samsung-tab-10-pro",
    },
    {
      author: "Світлана",
      reviewBody:
        "Телефон просто супер, дуже гарні знімки в різний час, дуже гучні динаміки, тримати в руках одне задоволення, відгук прекрасний",
      rating: 5,
      createdAt: new Date("2025-01-31T16:14:00Z"),
      productSlug: "samsung-tab-10-pro",
    },
    {
      author: "Влада",
      reviewBody:
        "Я загалом задоволена цим смартфоном. Він відповідає моїм очікуванням від флагмана цієї марки. Батареї вистачає до кінця дня, залишається близько 60% заряду.",
      rating: 5,
      createdAt: new Date("2024-12-31T18:34:00Z"),
      productSlug: "samsung-tab-10-pro",
    },
    {
      author: "Дмитро",
      reviewBody:
        "Класний смартфон, все на ньому літає! Міцний дизайн із задньою стороною з матового скла.",
      rating: 5,
      createdAt: new Date("2024-12-14T17:09:00Z"),
      productSlug: "samsung-tab-10-pro",
    },
    {
      author: "Семен",
      reviewBody:
        "Якщо порівнювати з попередником, то камера стала крутішою, робота телефону більш спритною, збільшилися можливості і покращився екран та звук. Розмір телефону залишився практично незмінним, хоча він став трохи більшим.",
      rating: 5,
      createdAt: new Date("2024-12-13T14:08:00Z"),
      productSlug: "samsung-tab-10-pro",
    },
    // Huawei Pura 70 Pro 12/512gb
    {
      author: "Андріана",
      reviewBody:
        "Камера просто вогонь, такої якості ще не бачив. Дисплей неймовірно плавний і яскравий із захистом для очей.",
      rating: 5,
      createdAt: new Date("2025-02-03T14:19:00Z"),
      productSlug: "huawei-pura-70-pro-512",
    },
    {
      author: "Світлана",
      reviewBody:
        "Телефон просто супер, дуже гарні знімки в різний час, дуже гучні динаміки, тримати в руках одне задоволення, відгук прекрасний",
      rating: 5,
      createdAt: new Date("2025-01-31T16:14:00Z"),
      productSlug: "huawei-pura-70-pro-512",
    },
    {
      author: "Влада",
      reviewBody:
        "Я загалом задоволена цим смартфоном. Він відповідає моїм очікуванням від флагмана цієї марки. Батареї вистачає до кінця дня, залишається близько 60% заряду.",
      rating: 5,
      createdAt: new Date("2024-12-31T18:34:00Z"),
      productSlug: "huawei-pura-70-pro-512",
    },
    {
      author: "Дмитро",
      reviewBody:
        "Класний смартфон, все на ньому літає! Міцний дизайн із задньою стороною з матового скла.",
      rating: 5,
      createdAt: new Date("2024-12-14T17:09:00Z"),
      productSlug: "huawei-pura-70-pro-512",
    },
    {
      author: "Семен",
      reviewBody:
        "Якщо порівнювати з попередником, то камера стала крутішою, робота телефону більш спритною, збільшилися можливості і покращився екран та звук. Розмір телефону залишився практично незмінним, хоча він став трохи більшим.",
      rating: 5,
      createdAt: new Date("2024-12-13T14:08:00Z"),
      productSlug: "huawei-pura-70-pro-512",
    },
    // Huawei Pura 70 Pro 12/256gb
    {
      author: "Андріана",
      reviewBody:
        "Камера просто вогонь, такої якості ще не бачив. Дисплей неймовірно плавний і яскравий із захистом для очей.",
      rating: 5,
      createdAt: new Date("2025-02-03T14:19:00Z"),
      productSlug: "huawei-pura-70-pro-256",
    },
    {
      author: "Світлана",
      reviewBody:
        "Телефон просто супер, дуже гарні знімки в різний час, дуже гучні динаміки, тримати в руках одне задоволення, відгук прекрасний",
      rating: 5,
      createdAt: new Date("2025-01-31T16:14:00Z"),
      productSlug: "huawei-pura-70-pro-256",
    },
    {
      author: "Влада",
      reviewBody:
        "Я загалом задоволена цим смартфоном. Він відповідає моїм очікуванням від флагмана цієї марки. Батареї вистачає до кінця дня, залишається близько 60% заряду.",
      rating: 5,
      createdAt: new Date("2024-12-31T18:34:00Z"),
      productSlug: "huawei-pura-70-pro-256",
    },
    {
      author: "Дмитро",
      reviewBody:
        "Класний смартфон, все на ньому літає! Міцний дизайн із задньою стороною з матового скла.",
      rating: 5,
      createdAt: new Date("2024-12-14T17:09:00Z"),
      productSlug: "huawei-pura-70-pro-256",
    },
    {
      author: "Семен",
      reviewBody:
        "Якщо порівнювати з попередником, то камера стала крутішою, робота телефону більш спритною, збільшилися можливості і покращився екран та звук. Розмір телефону залишився практично незмінним, хоча він став трохи більшим.",
      rating: 5,
      createdAt: new Date("2024-12-13T14:08:00Z"),
      productSlug: "huawei-pura-70-pro-256",
    },
    // Samsung S23 Ultra 12/256gb
    {
      author: "Андріана",
      reviewBody:
        "Камера просто вогонь, такої якості ще не бачив. Дисплей неймовірно плавний і яскравий із захистом для очей.",
      rating: 5,
      createdAt: new Date("2025-02-03T14:19:00Z"),
      productSlug: "samsung-23-ultra-256",
    },
    {
      author: "Світлана",
      reviewBody:
        "Телефон просто супер, дуже гарні знімки в різний час, дуже гучні динаміки, тримати в руках одне задоволення, відгук прекрасний",
      rating: 5,
      createdAt: new Date("2025-01-31T16:14:00Z"),
      productSlug: "samsung-23-ultra-256",
    },
    {
      author: "Влада",
      reviewBody:
        "Я загалом задоволена цим смартфоном. Він відповідає моїм очікуванням від флагмана цієї марки. Батареї вистачає до кінця дня, залишається близько 60% заряду.",
      rating: 5,
      createdAt: new Date("2024-12-31T18:34:00Z"),
      productSlug: "samsung-23-ultra-256",
    },
    {
      author: "Дмитро",
      reviewBody:
        "Класний смартфон, все на ньому літає! Міцний дизайн із задньою стороною з матового скла.",
      rating: 5,
      createdAt: new Date("2024-12-14T17:09:00Z"),
      productSlug: "samsung-23-ultra-256",
    },
    {
      author: "Семен",
      reviewBody:
        "Якщо порівнювати з попередником, то камера стала крутішою, робота телефону більш спритною, збільшилися можливості і покращився екран та звук. Розмір телефону залишився практично незмінним, хоча він став трохи більшим.",
      rating: 5,
      createdAt: new Date("2024-12-13T14:08:00Z"),
      productSlug: "samsung-23-ultra-256",
    },
    // Samsung Smart TV 32' 2025 4K
    {
      author: "Андріана",
      reviewBody:
        "Камера просто вогонь, такої якості ще не бачив. Дисплей неймовірно плавний і яскравий із захистом для очей.",
      rating: 5,
      createdAt: new Date("2025-02-03T14:19:00Z"),
      productSlug: "samsung-tv-32",
    },
    {
      author: "Світлана",
      reviewBody:
        "Телефон просто супер, дуже гарні знімки в різний час, дуже гучні динаміки, тримати в руках одне задоволення, відгук прекрасний",
      rating: 5,
      createdAt: new Date("2025-01-31T16:14:00Z"),
      productSlug: "samsung-tv-32",
    },
    {
      author: "Влада",
      reviewBody:
        "Я загалом задоволена цим смартфоном. Він відповідає моїм очікуванням від флагмана цієї марки. Батареї вистачає до кінця дня, залишається близько 60% заряду.",
      rating: 5,
      createdAt: new Date("2024-12-31T18:34:00Z"),
      productSlug: "samsung-tv-32",
    },
    {
      author: "Дмитро",
      reviewBody:
        "Класний смартфон, все на ньому літає! Міцний дизайн із задньою стороною з матового скла.",
      rating: 5,
      createdAt: new Date("2024-12-14T17:09:00Z"),
      productSlug: "samsung-tv-32",
    },
    {
      author: "Семен",
      reviewBody:
        "Якщо порівнювати з попередником, то камера стала крутішою, робота телефону більш спритною, збільшилися можливості і покращився екран та звук. Розмір телефону залишився практично незмінним, хоча він став трохи більшим.",
      rating: 5,
      createdAt: new Date("2024-12-13T14:08:00Z"),
      productSlug: "samsung-tv-32",
    },
    // Samsung Smart TV 42' 2025 4K
    {
      author: "Андріана",
      reviewBody:
        "Камера просто вогонь, такої якості ще не бачив. Дисплей неймовірно плавний і яскравий із захистом для очей.",
      rating: 5,
      createdAt: new Date("2025-02-03T14:19:00Z"),
      productSlug: "samsung-tv-42",
    },
    {
      author: "Світлана",
      reviewBody:
        "Телефон просто супер, дуже гарні знімки в різний час, дуже гучні динаміки, тримати в руках одне задоволення, відгук прекрасний",
      rating: 5,
      createdAt: new Date("2025-01-31T16:14:00Z"),
      productSlug: "samsung-tv-42",
    },
    {
      author: "Влада",
      reviewBody:
        "Я загалом задоволена цим смартфоном. Він відповідає моїм очікуванням від флагмана цієї марки. Батареї вистачає до кінця дня, залишається близько 60% заряду.",
      rating: 5,
      createdAt: new Date("2024-12-31T18:34:00Z"),
      productSlug: "samsung-tv-42",
    },
    {
      author: "Дмитро",
      reviewBody:
        "Класний смартфон, все на ньому літає! Міцний дизайн із задньою стороною з матового скла.",
      rating: 5,
      createdAt: new Date("2024-12-14T17:09:00Z"),
      productSlug: "samsung-tv-42",
    },
    {
      author: "Семен",
      reviewBody:
        "Якщо порівнювати з попередником, то камера стала крутішою, робота телефону більш спритною, збільшилися можливості і покращився екран та звук. Розмір телефону залишився практично незмінним, хоча він став трохи більшим.",
      rating: 5,
      createdAt: new Date("2024-12-13T14:08:00Z"),
      productSlug: "samsung-tv-42",
    },
    // Samsung Smart TV 56' 2025 4K
    {
      author: "Андріана",
      reviewBody:
        "Камера просто вогонь, такої якості ще не бачив. Дисплей неймовірно плавний і яскравий із захистом для очей.",
      rating: 5,
      createdAt: new Date("2025-02-03T14:19:00Z"),
      productSlug: "samsung-tv-56",
    },
    {
      author: "Світлана",
      reviewBody:
        "Телефон просто супер, дуже гарні знімки в різний час, дуже гучні динаміки, тримати в руках одне задоволення, відгук прекрасний",
      rating: 5,
      createdAt: new Date("2025-01-31T16:14:00Z"),
      productSlug: "samsung-tv-56",
    },
    {
      author: "Влада",
      reviewBody:
        "Я загалом задоволена цим смартфоном. Він відповідає моїм очікуванням від флагмана цієї марки. Батареї вистачає до кінця дня, залишається близько 60% заряду.",
      rating: 5,
      createdAt: new Date("2024-12-31T18:34:00Z"),
      productSlug: "samsung-tv-56",
    },
    {
      author: "Дмитро",
      reviewBody:
        "Класний смартфон, все на ньому літає! Міцний дизайн із задньою стороною з матового скла.",
      rating: 5,
      createdAt: new Date("2024-12-14T17:09:00Z"),
      productSlug: "samsung-tv-56",
    },
    {
      author: "Семен",
      reviewBody:
        "Якщо порівнювати з попередником, то камера стала крутішою, робота телефону більш спритною, збільшилися можливості і покращився екран та звук. Розмір телефону залишився практично незмінним, хоча він став трохи більшим.",
      rating: 5,
      createdAt: new Date("2024-12-13T14:08:00Z"),
      productSlug: "samsung-tv-56",
    },
    // General comments
    {
      author: "Сергій",
      reviewBody: "Клас",
      rating: 5,
      createdAt: new Date("2023-12-07T13:08:00Z"),
    },
    {
      author: "Дмитро",
      reviewBody: "Дуже задоволений покупкою. Дякую",
      rating: 5,
      createdAt: new Date("2022-12-23T11:54:00Z"),
    },
    {
      author: "Елеонора",
      reviewBody:
        "Перезвонили спустя два часа после того как оставила заказ. Можно было бы и раньше. Товаром довольна. За то что долго ждала звонок только 3 звезды. Исправляйтесь.",
      rating: 3,
      createdAt: new Date("2024-06-04T14:19:00Z"),
    },
    {
      author: "Катерина",
      reviewBody: "Купляла малому телефон соби планшет. Все круто. Дякую",
      rating: 5,
      createdAt: new Date("2024-05-02T10:10:00Z"),
    },
    {
      author: "Алексей",
      reviewBody:
        "Доставили оперативно. В обед заказал. На следующий день получил. Раньше не думал что такое вообще возможно.",
      rating: 5,
      createdAt: new Date("2024-05-01T08:47:00Z"),
    },
    {
      author: "Антонина",
      reviewBody: "Отличный магазин. Все сделали красиво",
      rating: 5,
      createdAt: new Date("2024-03-08T10:07:00Z"),
    },
  ],
};

export default sampleData;
