const WarrantyAndReturn = () => {
  return (
    <div className="wrapper flex-1 space-y-4 my-5">
      <div className="h2-bold">Прийняття замовлення</div>
      <div>
        Обробка замовлення протягом 1 дня та передача перевізнику &quot;Нова
        Пошта&quot;. Термін доставки розраховується перевізником в залежності
        від відстані до пункту призначення і складає від 1-3 днів
      </div>
      <div>
        <div className="h3-bold">Повернення</div>
        <div className="space-y-4">
          <div>
            Право повернення товару встановлюється відповідно до поточним
            законодавством країни Продавця. Умови повернення товарів належної та
            неналежної якості можуть різнитися.
          </div>
          <div>
            <div className="font-bold">
              Умови повернення товару належної якості
            </div>
            <div>
              Ця умова регулюється законодавством країни продавця, і зазвичай
              виконується протягом 14-ти днів із моменту передачі покупцю
              непродовольчого товару (якщо триваліший термін не оголошено
              продавцем) у місці придбання чи інших місцях, оголошених
              продавцем, товар підлягає поверненню та обміну, якщо він не був у
              вжитку, зберіг свої споживчі властивості, товарний вигляд,
              упаковку, пломби та ярлики.Товар належної якості можна повернути
              або обміняти його на аналогічний, якщо він не влаштовує споживача
              за розміром, формою, габаритами, забарвленням, комплектацією, або
              з інших причин, з яких товар не може бути використаний покупцем за
              призначенням.
            </div>
          </div>
          <div>
            <div className="font-bold">
              Умови повернення товару неналежної якості
            </div>
            <div>
              Ця умова регулюється законодавством країни продавця. Як правило, у
              разі виявлення протягом встановленого гарантійного строку
              недоліків споживач у строки, встановлені законодавством, має право
              на обмін товару або повернення коштів, сплачених за товар, без
              урахування вартості доставки. Покупець може повернути товар
              продавцю за таких умов:
            </div>
            <ul className="list-inside list-disc mt-3">
              <li>
                Наявність документа від уповноваженого виробником сервісного
                центру, де зазначено, що дефект є суттєвим;
              </li>
              <li>
                Збережений гарантійний талон та документ, що підтверджує оплату;
              </li>
              <li>Цілісність комплекту не порушена.</li>
            </ul>
          </div>
          <div className="space-y-3">
            <div>Способи повернення товару:</div>
            <ul className="list-inside list-disc ">
              <li>
                Збережений гарантійний талон та документ, що підтверджує оплату;
              </li>
              <li>Цілісність комплекту не порушена.</li>
            </ul>
            <div>
              Точніші умови повернення та обміну товару неналежної якості
              рекомендуємо уточнювати у продавця.
            </div>
          </div>
          <div className="font-bold">Способи повернення товару</div>
          <div>
            Для повернення товару необхідно зв&apos;язатися з представниками
            інтернет-магазину для отримання інформації про те, на яку адресу
            здійснити відправку. Вартість зворотної доставки здійснюється за
            окремою домовленістю із продавцем. Як правило, кошти надходять на
            рахунок покупця протягом 7 (семи) банківських днів, після того, як
            товар, що повертається, був доставлений на адресу продавця і пройшов
            перевірку на відповідність умовам повернення.
          </div>
          <div className="font-bold">Умови повернення товару</div>
          <div className="space-y-2">
            <div>
              При підтвердженні повернення товару можливі наступні варіанти
              повернення коштів:
            </div>
            <ul className="list-inside list-disc">
              <li>
                При оплаті товару платіжною банківською картою, повернення
                коштів буде здійснено на картку, з якої було здійснено оплату.
                При цьому наявність банківської платіжної картки є
                обов&apos;язковою.
              </li>
              <li>
                При оплаті товару через платіжні системи, встановлені в
                інтернет-магазині (онлайн платіж), повернення коштів буде
                здійснено протягом 7 банківських днів на картку, з якої було
                здійснено оплату.
              </li>
              <li>
                При оплаті товару банківським переказом або іншим способом, що
                не передбачає використання банківської картки, необхідно
                зв&apos;язатися з продавцем для отримання додаткової інформації
                про способи повернення коштів.
              </li>
            </ul>
          </div>
        </div>
      </div>
      <div className="h2-bold">Гарантія</div>
      <div>Гарантія на заводський брак від 12 до 24 місяців</div>
    </div>
  );
};

export default WarrantyAndReturn;
